{"pages":[{"title":"about","text":"","link":"/about/index.html"}],"posts":[{"title":"HEXO 문법 및 세팅 관련","text":"Markdown 구문참고자료0참고자료1참고자료2 기본 사용법 HEXO 기본 사용방법포스팅하기 (Writing)마크다운 파일 생성하기마크다운을 작성할 파일을 만드는 것부터 시작합니다.다음 명령어를 통해 작성할 마크다운 파일이 해당 경로에 생성됩니다. 1$ hexo new [layout] &lt;title&gt; layout : 기본 레이아웃은 3종류가 있고 각기 다른 경로에 보관됩니다. post page draft layout을 생략할 경우 post로 생성됩니다. title : 파일 제목을 입력합니다. 레이아웃 (Layout) 레이아웃 파일 경로 post source/_posts page source draft source/_drafts 포스트 (Post)홈페이지에 게시되는 기본적인 게시물입니다.기본 레이아웃이라서 레이아웃 종류를 별도로 입력하지 않아도 포스트로 자동 인식됩니다.기본 레이아웃은 _config.yml의 default_layout 항목에서 변경 가능합니다. 페이지 (page)포스트처럼 새 글을 추가하는 것이 아니라 해당 경로로 접근해야 볼 수 있는 고정 페이지를 작성할 때 사용합니다. 초안 (Draft)draft는 바로 게시하지 않고 작성할 수 있는 초안입니다.따라서 포스트를 작성할 때 먼저 초안을 작성하고, 작성완료 후 publish 명령어로 배포하는 형식으로 게시할 수 있습니다. 초안을 기본 레이아웃으로 사용할 경우 _config.yml의 default_layout'을 draft로 변경하면hexo new 로 생성했을 때 포스트가 아닌 드래프트로 만들어 집니다. 하지만 작업하면서 실제 화면에서 어떻게 보일지 궁금할 경우 로컬서버 실행 시–draft` 옵션을 주면 로컬서버에서 draft로 작성한 것도 확인할 수 있습니다. 1$ hexo server --draft 매번 이렇게 실행하는 것이 귀찮다면, _config.yml파일에서 render_drafts 항목을 true 로 변경하시면 됩니다. 하지만 이 경우 원격 서버에도 초안이 나타나기 때문에 권장하지는 않습니다. _config.yml12# Writingrender_drafts: true 파일명1$ hexo new [layout] &lt;title&gt; 신규 파일생성 시 입력하는 title이 기본적으로 파일명이 됩니다.파일명이 곧 페이지의 URL이 되기 때문에 파일명은 본문 내용의 핵심 키워드를 조합해서 만드는 것이 좋습니다. 그래야 검색에 잘 노출될 수 있습니다. 1$ hexo new post 'test page' 위와 같은 명령어를 입력하면 test-page.md라는 파일이 생성됩니다. 만약 날짜를 prefix로 사용하고 싶다면 :year:month:day-:title.md 이런 형식으로 placeholder를 이용해서 커스터마이징할 수 있습니다. _config.yml12# Writingnew_post_name: :year:month:day-:title.md 사용할 수 있는 placeholder는 다음과 같습니다. Placeholder Description :title 포스트 제목 (소문자만 가능, 공백(space)은 하이픈(-)으로 대체됨) :year 생성 연도 (e.g. 2019) :momth 생성 월 (0 포함, e.g. 09) :i_month 생성 월 (e.g. 4) :day 생성 날짜 (0 포함, e.g. 05) :i_day 생성 날짜 (e.g. 5) 스캐폴드 (Scaffolds)스캐폴드는 사전에서 찾아보면 ‘높은 곳에서 공사를 할 수 있도록 임시로 설치한 가설물’이라고 나옵니다.즉, 포스트, 페이지, 드래프트를 만들 때 처음 나오는 구조를 정의하는 파일입니다. 물론 커스텀 스캐폴드를 만들어 사용할 수 있습니다.기본 값은 아래와 같습니다. /scaffolds/post.md12345---title: {{ title }}date: {{ date }}tags:--- Front-matterFront-matter는 포스트 최상단에 있는 블록으로 해당 파일의 정보를 입력하는 곳입니다. 상기 예시에서 보신 것과 같이 --- 로 구분되어 있는 블록입니다. 설정많이 사용하는 것들은 스캐폴드에 정의해 놓으면 편하게 사용할 수 있습니다. 설정 설명 기본 값 layout 레이아웃 title 제목 date 배포한 날짜 파일 생성 날짜 updated 수정된 날짜 파일 생성 날짜 comments 코멘트 기능 여부 true tags 태그 (Page에서는 사용불가) categories 카테고리 (Page에서는 사용불가) permalink 포스트 URL 지정 가능 thumbnail 썸네일 지정 본문 첫 번째 이미지 카테고리와 태그카테고리와 태그는 Post와 Draft에서만 사용 가능합니다.카테고리를 지정하면 메인 화면의 메뉴에 자동으로 추가됩니다. 카테고리는 여러 개를 지정할 경우 아래에 있는게 서브 카테고리가 됩니다.태그는 여러 개 설정할 수 있습니다. 1234567categories:- Web- Hexotags:- hexo- blog- framework 자원 폴더 (Asset Folders)자원 폴더는 해당 포스트에서 사용하는 여러가지 자원(이미지, 동영상, 링크 등)을 저장하는 폴더입니다. Hexo는 source상에 있는 자언을 가지고 public폴더를 생성합니다. public폴더가 실제 서버에 올라가는 폴더입니다. 그렇다고 public폴더에 자원을 직접 추가하면 안됩니다. public폴더는 generate할 때마다 새롭게 생성되기 때문에 자원은 source 폴더 내에서 관리해야 합니다. 전역 자원 폴더(Global Asset Folders)전역 자원 폴더는 /source/에 있는 폴더입니다. 여기에 폴더를 만들어 접근할 수 있습니다. 예를 들어 /source/images라는 폴더를 생성하면 소스 내에서 /images/경로로 바로 접근이 가능합니다. 어느 포스트나 동일하게 사용이 가능합니다. 포스트 자원 폴더 (Post Asset Folders)모든 자원을 전역 폴더 하나에서 관리하기보다 포스트마다 각각 폴더를 만들어 관리하는 방법도 있습니다. _config.yml12# Writingpost_asset_folder: true 위와 같이 _config.yml에서 설정을 변경하면 $ hexo new [layout] &lt;title&gt; 명령어로 새 글을 생성할 때마다 함께 폴더가 생성됩니다. 폴더 생성 후 그 폴더 안에 이미지 등을 넣고 절대 경로가 아닌 상대 경로로 바로 접근이 가능합니다. 기존에는 절대 경로인 /images/~~/example.png라고 접속했다면, 이후 상대 경로인 example.png로 접근할 수 있게 됩니다. 1![](example.png) 하지만 문제는 그냥 포스트 상에서는 되지만 카테고리, 태그, 아카이브 등으로 해당 포스트 접속 시 URL이 달라져서 이미지에 접근이 안됩니다.그래서 여러 포스트에서 공통적으로 사용할 이미지는 전역 폴더에 포스트 상에서만 사용할 경우는 포스트 폴더에 저장하여 활용하면 됩니다. HEXO CNAME 플러그인CNAME 생성을 위한 패키징 설치 1npm install hexo-generator-cname --save _config.yml 파일의 플러그인 설정 _config.yml12plugins:- hexo-generator-cname _config.yml 파일의 url 이름이 적용한 Domain과 일치하는지 확인 _config.yml1url: https://blog.kang2oon.com","link":"/2019/08/19/hexo/"},{"title":"2019년 한글날 기념 무료배포 한글 폰트","text":"언제가부터 매년 한글날이면 많은 기업체와 단체들에서 한글날 기념 무료 폰트를 제작하여 배포하고 있다.디자이너들이나 폰트를 많이 사용하는 일반인들의 경우 영문 폰트에 비해 무료로 사용할 수 있는 한글 폰트가 부족하여 항상 주로 사용하던 폰트 위주로 사용을 많이 하게 되는데, 매년 새로운 폰트가 무료로 배포되고 있는 것은 아주 반가운 일이 아닐 수 없다. 기업의 정체성을 나타낼 수 있는 특유의 개성을 포함하여 폰트를 제공함으로서 간접적인 홍보 효과도 나타낼 수 있으며, 사용자 입장에서는 한정된 폰트를 이용하던 것에 비해 다양한 폰트를 활용할 수 있음에 서로가 상생할 수 있는 방향으로 나아가는 길이라 생각된다. 2019년 573돌을 맞이한 한글날, 새롭게 배포된 한글 폰트를 소개해 보고자 한다.배포되는 대부분의 폰트는 저작권에 구애받지 않고 자유롭게 사용할 수 있으나, 간혹 서체마다 저작권에 약간씩의 차이가 있을 수 있으니, 반드시 저작권에 대한 정확한 정보 확인 후 사용하여 추후 발생할 수 있는 불상사에도 대비할 수 있도록 해야 하겠다. 네이버 ‘나눔손글씨’ 109종네이버에서 지난 9월부터 한글날 이벤트로 직접 쓴 손글씨 공모전을 진행하여 선정된 109종의 손글씨를 폰트로 제작하여 배포한다. ‘네이버 나눔손글씨’ 바로가기 유의사항 나눔손글씨 글꼴은 기업 및 단체 또는 개인 누구나 무료로 사용할 수 있습니다.다만, 나눔손글씨 글꼴 파일을 유상으로 제공, 판매, 배포하는 것은 금지됩니다. 한글날 손글씨 공모전 참여 시 입력한 글꼴명 및 글꼴 소개말은 임의로 변경되었을 수 있습니다. 제공하는 글꼴의 무료 제공 기간은 당사의 사정에 따라 예고 없이 변동될 수 있습니다. SBS 런닝맨 ‘전소민체’SBS ‘런닝맨 전소민체’는 한글날 특집 우승자인 전소민씨가 직접 작성한 자필 원고의 특징을 살려 ‘전소민’씨의 개성을 담고, 가독성을 고려한 손글씨 폰트로 만들어졌다.한글날 기념 ‘런닝맨 전소민체’는 ‘윤디자인그룹’이 함께 했습니다. 다만, 무료 배포기간이 2020년 1월 5일까지 3개월만 제공된다고 하니 원하는 분들은 빠른 다운로드를 해주셔야 되겠습니다. ‘런닝맨 전소민체’ 바로가기 저작권 안내 런닝맨 전소민체 글꼴 파일의 저작권은 SBS와 전소민, (주)윤디자인그룹에 있습니다. 런닝맨 전소민체 폰트 파일은, 3개월(2019.10.06 ~ 2020.01.05) 동안 무료로 제공하며,별도의 승인 없이 인쇄, 출판, 영상, 웹 모바일 등 다양한 매체에서 상업적 목적으로도 자유롭게 사용이 가능합니다.(단, 해당 글꼴을 변형하거나 폰트 파일 자체를 유료로 판매 또는 대여할 수 없으며 유해매체에서의 사용은 금지합니다) 런닝맨 전소민체 폰트를 사용한 인쇄물, 광고물(온라인 포함)의 이미지는 폰트 파일 저작권자의 홍보, 프로모션을 위해 활용될 수 있음에 동의합니다. 전소민체 폰트 파일 저작권에 대하여, 궁금한 사항이 있으시면 담당자(02-2287-6708)에게 연락 주시기 바랍니다. 사용범위 런닝맨 전소민체 폰트 파일은 개인/기업 구분없이 누구나 사용 가능합니다. 인쇄, 출판, 영상, 웹, 모바일 등 다양한 매체에서 상업적 목적으로 자유롭게 영구적인 사용이 가능합니다. 사용불가 폰트 파일의 수정 및 변형(디지털포맷 변경)을 포함한 개작, 개명을 통한 사용 별도 허락없이 임의로 재배포 및 유료양도 / 재판매 등의 상업적 행위 및 성인물, 도박물 등 유해매체에서의 사용 위 사항을 위반하는 경우, 위반 당사자는 저작권 침해에 따른 일체의 민형사상의 책임을 부담합니다. 별도문의 관련문의 : 02-2287-6703 / yoondesign@yoondesign.com 배달의민족 ‘을지로체’2012년 ‘한나체’ 공개를 시작으로 매년 한글날마다 ‘배달의민족’만의 감성으로 재생산한 무료 서체를 배달하고 있는 우아한형제들은 올해 ‘배달의민족 을지로체’를 새롭게 선보인다.‘베달의민족 을지로체’는 무명의 간판 글씨 장인이 그린 을지로 일대 가게들의 간판을 바탕으로 만든 것으로 획 마다의 힘찬 시작과 페인트 붓의 여유로운 끝 모양이 특징이다. ‘배달의민족 을지로체’ 바로가기 라이선스 주요내용 배달의민족 서체의 지적재산권은 (주)우아한형제들에 있습니다. 배달의민족 서체는 개인 및 기업 사용자를 포함한 모든 사용자에게 무료로 제공되며 자유롭게 수정하고 재배포하실 수 있습니다. 단, 글꼴 자체를 유료로 판매하는 것은 금지하며, 배달의민족 서체는 저작권 안내와 라이선스 전문을 포함해서 다른 소프트웨어와 번들하거나 재배포 또는 판매가 가능합니다.[라이선스 전문보기] 빙그레 ‘메로나체’2016년, 2017년, 2018년에 이어 한글서체 시리즈 제 4탄, ‘빙그레 메로나체’메로나 로고타입의 특징적인 요소를 자소에 반영하고 반듯한 네모의 형태로 젊은 느낌을 주는 구조로 레트로 감성을 표현하여 제작되었습니다.국문학자와 디자이너의 자문 의견을 반영하여 한글 11,172자와 한글날의 의미를 생각해 볼 수 있는 훈민정음 서문의 옛한글 31자를 추가로 개발하였습니다. ‘빙그레 메로나체’ 바로가기 라이선스 주요내용 빙그레 서체의 지적 재산권은 빙그레(www.bing.co.kr)에 있습니다. 빙그레 서체는 개인 및 기업 사용자를 포함한 모든 사용자에게 무료로 제공합니다. 빙그레 서체는 인쇄물, 광고물, 온라인 등 상업적 목적으로 사용할 수 있습니다. 단, 글꼴 자체를 유료로 판매하는 것은 금지하며 빙그레 서체는 수정 및 재배포를 할 수 없으며, 배포되는 형태 그대로 사용해야 합니다. 빙그레 서체를 사용한 인쇄물, 광고물(온라인 포함)의 이미지는 빙그레 프로모션을 위해 활용될 수 있습니다.이를 원치 않는 사용자는 언제든지 당사에 요청하실 수 있습니다.[라이선스 및 사용범위 전문보기] 넥슨 폰트 5종넥슨 레벨업넥슨의 LEVEL UP(레벨업) 첫 단계로 게임에서 경험했던 느낌을 서체에 담아 표현했습니다. 서체의 기능적인 부분 외에도 즐거운 경험들을 전달하고자 하는 또 다른 도전의 시작입니다.넥슨 Lv1. 고딕을 시작으로 레벨업이 돼 듯 Lv2. 고딕으로 업그레이드 되었고, 배찌손글씨체, 넥슨 풋볼 고딕, 메이플 서체 등 게임의 개성을 담아 다양한 서체를 제공하고 있습니다. ‘넥슨 서체 5종’ 바로가기 넥슨 폰트 사용정책 제공되는 모든 서체의 지적 재산권을 포함한 모든 권리는 (주)넥슨코리아에 있습니다. 제공되는 모든 서체는 개인, 학교, 공익목적의 자선, 구호단체에서 비상업적인 용도로만 사용 가능 합니다.단, 유료로 판매하거나 어떠한 이유로든 복사 및 배포의 대가로 요금을 부과/수령할 수 없으며, 인쇄물, 광고물, 온라인에서 상업적인 목적으로 사용할 수 없습니다. (주)넥슨코리아 이외에 임의로 수정, 편집 등을 할 수 없으며 배포되는 형태 그대로 사용해야 합니다. 디자인210 뿌리깊은 프로젝트 5호 서체 ‘ON정속언해’디자인210에서는 시대별 의미있는 글씨를 연구하며 뜻을 이어가고자 2018년 10월 석보상절을 시작으로 앞으로 출시되는 뿌리깊은 서체들이 3년간 개발, 런칭, 배포 됩니다.이에 573동 한글날을 맞이하여 프로젝트 5호 서체인 ‘ON정속언해’가 공개되었습니다.‘ON정속언해’는 ‘여씨향약언해’와 함께 백성들의 풍속을 교화시키기 위한 교화서 ‘정속언해’ 그 속에 담긴 의의와 한글 서체의 아름다움을 널리 알리고자 제작된 뿌리깊은 서체입니다. ‘ON정속언해’ 바로가기 라이선스 사용범위 제한없음 사용기한 제한없음 사용대상 누구나 사용자수 제한없음[라이선스 자세히보기] 폰트 프로젝트팀 ‘109폰트’2019 Korean day Font Project Team세 명이 팀을 꾸려서 각자 하고싶은 개성있는 폰트를 디자인하고 폰트를 제작하는 방식으로 ‘109다람쥐꼬리/109박스테이브/109벽에기댄체’ 3종의 폰트를 공개하였습니다. ‘Korean day Font Project Team 폰트 3종’ 바로가기 라이선스 자유롭게 사용 및 수정 가능 단, 유료배포 및 수정재배포 금지 많은 기업과 단체에서 한글의 다양성과 우수성을 알리고 많은 사람들이 널리 이롭게 사용할 수 있는 서체를 개발하여 배포하고 있습니다.제작하여 공개해 주심에 다시 한번 감사를 드리며, 잘 사용할 수 있도록 하겠습니다. 사용하심에 있어 서체마다의 라이선스가 다르니, 꼭 정확한 라이선스를 확인하시어 사용하시기 바랍니다.","link":"/2019/10/10/ko-fonts-2019/"}],"tags":[{"name":"hexo","slug":"hexo","link":"/tags/hexo/"},{"name":"blog","slug":"blog","link":"/tags/blog/"},{"name":"폰트","slug":"폰트","link":"/tags/폰트/"},{"name":"한글 서체","slug":"한글-서체","link":"/tags/한글-서체/"},{"name":"네이버","slug":"네이버","link":"/tags/네이버/"},{"name":"나눔손글씨","slug":"나눔손글씨","link":"/tags/나눔손글씨/"},{"name":"런닝맨","slug":"런닝맨","link":"/tags/런닝맨/"},{"name":"전소민체","slug":"전소민체","link":"/tags/전소민체/"},{"name":"배달의민족","slug":"배달의민족","link":"/tags/배달의민족/"},{"name":"을지로체","slug":"을지로체","link":"/tags/을지로체/"},{"name":"빙그레","slug":"빙그레","link":"/tags/빙그레/"},{"name":"메로나체","slug":"메로나체","link":"/tags/메로나체/"},{"name":"넥슨","slug":"넥슨","link":"/tags/넥슨/"},{"name":"Lv1. 고딕","slug":"Lv1-고딕","link":"/tags/Lv1-고딕/"},{"name":"Lv.2 고딕","slug":"Lv-2-고딕","link":"/tags/Lv-2-고딕/"},{"name":"배찌손글씨체","slug":"배찌손글씨체","link":"/tags/배찌손글씨체/"},{"name":"풋볼 고딕","slug":"풋볼-고딕","link":"/tags/풋볼-고딕/"},{"name":"메이플체","slug":"메이플체","link":"/tags/메이플체/"},{"name":"ON정속언해","slug":"ON정속언해","link":"/tags/ON정속언해/"},{"name":"디자인 210","slug":"디자인-210","link":"/tags/디자인-210/"},{"name":"정속언해체","slug":"정속언해체","link":"/tags/정속언해체/"},{"name":"109폰트","slug":"109폰트","link":"/tags/109폰트/"},{"name":"109다람쥐꼬리","slug":"109다람쥐꼬리","link":"/tags/109다람쥐꼬리/"},{"name":"109박스테이브","slug":"109박스테이브","link":"/tags/109박스테이브/"},{"name":"109벽에기댄체","slug":"109벽에기댄체","link":"/tags/109벽에기댄체/"},{"name":"fonts","slug":"fonts","link":"/tags/fonts/"}],"categories":[{"name":"hexo","slug":"hexo","link":"/categories/hexo/"},{"name":"Resource","slug":"Resource","link":"/categories/Resource/"},{"name":"Fonts","slug":"Resource/Fonts","link":"/categories/Resource/Fonts/"}]}