{"pages":[{"title":"about","text":"","link":"/about/index.html"},{"title":"","text":"naver-site-verification: naverd9cb384ad47a2b11dbb1b3979cef0093.html","link":"/naverd9cb384ad47a2b11dbb1b3979cef0093.html"}],"posts":[{"title":"Google One 무료체험","text":"구글에서 지역 가이드 기여도가 높은 사용자 대상으로 구글 원(Google One)을 무료로 체험해 볼 수 있는 서비스가 있습니다. 기여도가 높은 사용자를 위해 Google One 멤버십 12개월을 무료 제공한다는 메일을 받고 해당 서비스를 신청해 보았습니다. 기여도에 따라 조금 다른 부분이 있는 것 같습니다.메일에서는 12개월 무료 제공이라고 되어 있었으나, 실제 신청하는 과정에서는 6개월 무료 체험으로 진행이 되었습니다. Google One 이란? Google One 서비스는 확장 스토리지가 제공되는 멤버십 요금제로, Google을 최대한 활용할 수 있는 추가 혜택이 제공됩니다. 라고 명시되어 있습니다. ‘Google One’ 바로가기 예전 Google 드라이브의 추가 용량 서비스가 Google One으로 개편되어 서비스 되고 있습니다.확장된 스토리지에는 Google 드라이브, Gmail, Google 포토의 원본 화질 이미지가 포함됩니다. 옵션 목록에서 원하는 스토리지를 선택하여 업그레이드 할 수 있습니다. Google One의 요금제는 6가지로 구분되어 있으며, 예전 Google 드라이브 1TB 이용자들은 동일한 요금으로 2TB를 사용할 수 있다고 하는군요.무료 체험이벤트에는 100GB 요금제가 제공되었습니다. Google은 가입 시 개인 당 15GB의 용량이 제공되는데 이번 무료 체험을 통해 100GB로 용량이 확장되었습니다. 저의 경우 아이들이 아직 어린 관계로 Google Family Link 서비스를 이용하여 아이들을 가입시키고 이용하고 있습니다. 참고로 Google은 만 13세 미만 아이들은 직접 가입할 수 가 없습니다. 부모님이 Family 그룹을 만들고 아이들을 추가시킬 수 있는 형태로 아이들의 스마트폰에 해당 계정으로 로그인하면 부모 권한을 가진 성인이 아이들의 이용시간 설정, 앱 설치 관리 등을 할 수 있으며, Youtube가 비활성화되고 Youtube kids가 설치됩니다.최근 Youtube kids에서 아이들의 이용행태 등을 수집하는 문제로 구글이 제제를 당했었죠. 즉, 가족 그룹을 만들면 최대 본인 포함 6명까지 그룹으로 지정을 할 수 있으며, 다양한 편의 사항이 있습니다.우선 Google One의 확장된 스토리지를 공유해서 사용할 수 있습니다. 또한 Google Movie에서 영화를 구매하거나 대여 시 가족 그룹에 있는 사람과 공유해서 감상할 수 있으며, Youtube premium 서비스도 함께 사용이 가능합니다.1명만 결제를 하면 모든 가족 구성원이 사용할 수 있다는 부분은 너무 좋은 거 같습니다. Google One 멤버십에 가입된 사용자의 경우 로그인 후 개인 아바타에 구글의 4가지 컬러로 테두리가 생깁니다. 이것도 참 예쁘군요. 그 외에도 구글 서비스를 이용하다가 불편 사항이 있다면 지원을 빠르게 받아 볼 수 도 있습니다. Google One 멤버십 회원들의 혜택을 정리해 보면, Google 드라이브, Gmail, Google 포토의 원본 화질 사진 및 동영상의 스토리지 요금제 관리 스마트폰 자동 백업 기능 Google 문의 서비스 Google 스토어 리워드(최대 10% 환급), Google Play 크레딧, 호텔 특가 등 제공 최대 5명과 요금제 공유 가 있습니다. 아직 가입한지 얼마되지 않고 저 이외 가족들은 용량에 대한 부족을 아직 느끼지 못한 상태지만 전 예전에 용량이 부족해서 데이터를 선별적으로 삭제한 경험이 있어 15GB에서 100GB로 늘어났다는 것만으로도 아주 만족하고 있습니다.Youtube premium 서비스도 사용하다가 중지했는데 다시 살려볼까 합니다. 가족이 다 같은 혜택을 받을 수 있다니 참 메리트가 있어 보입니다.","link":"/2019/11/26/google-one/"},{"title":"HEXO 문법 및 세팅 관련","text":"Markdown 구문참고자료0참고자료1참고자료2 기본 사용법 HEXO 기본 사용방법포스팅하기 (Writing)마크다운 파일 생성하기마크다운을 작성할 파일을 만드는 것부터 시작합니다.다음 명령어를 통해 작성할 마크다운 파일이 해당 경로에 생성됩니다. 1$ hexo new [layout] &lt;title&gt; layout : 기본 레이아웃은 3종류가 있고 각기 다른 경로에 보관됩니다. post page draft layout을 생략할 경우 post로 생성됩니다. title : 파일 제목을 입력합니다. 레이아웃 (Layout) 레이아웃 파일 경로 post source/_posts page source draft source/_drafts 포스트 (Post)홈페이지에 게시되는 기본적인 게시물입니다.기본 레이아웃이라서 레이아웃 종류를 별도로 입력하지 않아도 포스트로 자동 인식됩니다.기본 레이아웃은 _config.yml의 default_layout 항목에서 변경 가능합니다. 페이지 (page)포스트처럼 새 글을 추가하는 것이 아니라 해당 경로로 접근해야 볼 수 있는 고정 페이지를 작성할 때 사용합니다. 초안 (Draft)draft는 바로 게시하지 않고 작성할 수 있는 초안입니다.따라서 포스트를 작성할 때 먼저 초안을 작성하고, 작성완료 후 publish 명령어로 배포하는 형식으로 게시할 수 있습니다. 초안을 기본 레이아웃으로 사용할 경우 _config.yml의 default_layout'을 draft로 변경하면hexo new 로 생성했을 때 포스트가 아닌 드래프트로 만들어 집니다. 하지만 작업하면서 실제 화면에서 어떻게 보일지 궁금할 경우 로컬서버 실행 시–draft` 옵션을 주면 로컬서버에서 draft로 작성한 것도 확인할 수 있습니다. 1$ hexo server --draft 매번 이렇게 실행하는 것이 귀찮다면, _config.yml파일에서 render_drafts 항목을 true 로 변경하시면 됩니다. 하지만 이 경우 원격 서버에도 초안이 나타나기 때문에 권장하지는 않습니다. _config.yml12# Writingrender_drafts: true 파일명1$ hexo new [layout] &lt;title&gt; 신규 파일생성 시 입력하는 title이 기본적으로 파일명이 됩니다.파일명이 곧 페이지의 URL이 되기 때문에 파일명은 본문 내용의 핵심 키워드를 조합해서 만드는 것이 좋습니다. 그래야 검색에 잘 노출될 수 있습니다. 1$ hexo new post 'test page' 위와 같은 명령어를 입력하면 test-page.md라는 파일이 생성됩니다. 만약 날짜를 prefix로 사용하고 싶다면 :year:month:day-:title.md 이런 형식으로 placeholder를 이용해서 커스터마이징할 수 있습니다. _config.yml12# Writingnew_post_name: :year:month:day-:title.md 사용할 수 있는 placeholder는 다음과 같습니다. Placeholder Description :title 포스트 제목 (소문자만 가능, 공백(space)은 하이픈(-)으로 대체됨) :year 생성 연도 (e.g. 2019) :momth 생성 월 (0 포함, e.g. 09) :i_month 생성 월 (e.g. 4) :day 생성 날짜 (0 포함, e.g. 05) :i_day 생성 날짜 (e.g. 5) 스캐폴드 (Scaffolds)스캐폴드는 사전에서 찾아보면 ‘높은 곳에서 공사를 할 수 있도록 임시로 설치한 가설물’이라고 나옵니다.즉, 포스트, 페이지, 드래프트를 만들 때 처음 나오는 구조를 정의하는 파일입니다. 물론 커스텀 스캐폴드를 만들어 사용할 수 있습니다.기본 값은 아래와 같습니다. /scaffolds/post.md12345---title: {{ title }}date: {{ date }}tags:--- Front-matterFront-matter는 포스트 최상단에 있는 블록으로 해당 파일의 정보를 입력하는 곳입니다. 상기 예시에서 보신 것과 같이 --- 로 구분되어 있는 블록입니다. 설정많이 사용하는 것들은 스캐폴드에 정의해 놓으면 편하게 사용할 수 있습니다. 설정 설명 기본 값 layout 레이아웃 title 제목 date 배포한 날짜 파일 생성 날짜 updated 수정된 날짜 파일 생성 날짜 comments 코멘트 기능 여부 true tags 태그 (Page에서는 사용불가) categories 카테고리 (Page에서는 사용불가) permalink 포스트 URL 지정 가능 thumbnail 썸네일 지정 본문 첫 번째 이미지 카테고리와 태그카테고리와 태그는 Post와 Draft에서만 사용 가능합니다.카테고리를 지정하면 메인 화면의 메뉴에 자동으로 추가됩니다. 카테고리는 여러 개를 지정할 경우 아래에 있는게 서브 카테고리가 됩니다.태그는 여러 개 설정할 수 있습니다. 1234567categories:- Web- Hexotags:- hexo- blog- framework 자원 폴더 (Asset Folders)자원 폴더는 해당 포스트에서 사용하는 여러가지 자원(이미지, 동영상, 링크 등)을 저장하는 폴더입니다. Hexo는 source상에 있는 자언을 가지고 public폴더를 생성합니다. public폴더가 실제 서버에 올라가는 폴더입니다. 그렇다고 public폴더에 자원을 직접 추가하면 안됩니다. public폴더는 generate할 때마다 새롭게 생성되기 때문에 자원은 source 폴더 내에서 관리해야 합니다. 전역 자원 폴더(Global Asset Folders)전역 자원 폴더는 /source/에 있는 폴더입니다. 여기에 폴더를 만들어 접근할 수 있습니다. 예를 들어 /source/images라는 폴더를 생성하면 소스 내에서 /images/경로로 바로 접근이 가능합니다. 어느 포스트나 동일하게 사용이 가능합니다. 포스트 자원 폴더 (Post Asset Folders)모든 자원을 전역 폴더 하나에서 관리하기보다 포스트마다 각각 폴더를 만들어 관리하는 방법도 있습니다. _config.yml12# Writingpost_asset_folder: true 위와 같이 _config.yml에서 설정을 변경하면 $ hexo new [layout] &lt;title&gt; 명령어로 새 글을 생성할 때마다 함께 폴더가 생성됩니다. 폴더 생성 후 그 폴더 안에 이미지 등을 넣고 절대 경로가 아닌 상대 경로로 바로 접근이 가능합니다. 기존에는 절대 경로인 /images/~~/example.png라고 접속했다면, 이후 상대 경로인 example.png로 접근할 수 있게 됩니다. 1![](example.png) 하지만 문제는 그냥 포스트 상에서는 되지만 카테고리, 태그, 아카이브 등으로 해당 포스트 접속 시 URL이 달라져서 이미지에 접근이 안됩니다.그래서 여러 포스트에서 공통적으로 사용할 이미지는 전역 폴더에 포스트 상에서만 사용할 경우는 포스트 폴더에 저장하여 활용하면 됩니다. HEXO CNAME 플러그인CNAME 생성을 위한 패키징 설치 1npm install hexo-generator-cname --save _config.yml 파일의 플러그인 설정 _config.yml12plugins:- hexo-generator-cname _config.yml 파일의 url 이름이 적용한 Domain과 일치하는지 확인 _config.yml1url: https://blog.kang2oon.com","link":"/2019/08/19/hexo/"},{"title":"트루비 프리미엄 사운드바 TP60 개봉기","text":"최근 잘 사용하던 TV가 사운드가 자꾸 음소거되는 현상이 발생하여 A/S하려니 메인 보드 교체가 필요해서 비용이 20만원이 넘는다고 하여 사운드바를 구매하게 되었습니다.사운드바 구매를 위해 “검색엔진”에 사운드바 추천을 검색했더니 아우스페이스의 1809A PLUS라는 모델이 눈에 띄었습니다.5만원대 가격에 60W 출력을 지원하는 사운드바… 구매하려고 하는 모델을 결정했으니 최저가 검색을 해서 구매를 했습니다.쿠팡이 배송료 포함으로 가장 저렴했습니다. 구매 좌표는 위에 쿠팡 링크를 클릭하시면 이동됩니다.그런데 8월 18일 00시에 구매를 하여 8월 20일 도착 예정으로 표시가 되었으나, 18일 14시경 업체에서 문자가 왔습니다. 문자의 내용은 쿠팡에서 주문하신 상품의 판매자입니다.배송지연으로 불편을 드려 죄송합니다.고객님의 상품을 곧 택배사로 전달할 예정입니다. 이런 내용의 문자가 와서 조금 늦나보다 여유를 가지고 기다리고 있었습니다.그런데 해당 판매자의 상품이 쿠팡뿐 아니라 네이버 스토어, 11번가 등에서 판매가 되고 있었고 품절임박 재고 9개로 표시가 되어 있는데 왜 늦어지는지 정확한 이유는 나와있지 않고 지연되고 있다고만 와서 궁금한 부분도 있었습니다.결국 기다리다 지쳐 쿠팡 구매 페이지에서 배송자에게 문의를 했습니다. 다음 날 전화가 와서 해당 상품이 재고가 없다는 것이었습니다. 코로나로 생산에 차질이 생겼다고.. 판매자 측에선 동일한 모델인데 브랜드만 다른 제품이 있다고 그것으로 배송해 주면 안되냐는 양해를 구하셔서 그렇게 해달라고 하고 통화한 다음 날인 어제(8월 27일)에서야 물건을 수령했습니다. 그런데 물건을 받아보니 동일한 모델이 아니더라구요..1809A 모델은 네모난 모델인데 동그랗게 생긴 모델이 왔습니다.배송받은 사운드바는 오히려 1904A 라는 모델명으로 판매되는 모델과 동일하게 생긴 모델이었습니다. 1904A 모델은 1809A 모델보다 상위모델로 가격이 더 높았으며, 오히려 모든 사이트에서 품절로 표시되었던 모델이었습니다.1809A와 1904A 모델의 가장 큰 차이는 형태와 길이, 그리고 HDMI 지원여부 인거 같았습니다. 정확히 제가 받은 모델은 아워스페이스의 1904A 모델은 아닙니다.브랜드는 트루비, 모델명은 TP60 이었습니다. 사운드바 자체 길이만 89Cm로 약 1M에 달하는 사이즈였습니다. 사운드바 정보 모델명 truvii TP60 정격전압 AV 110-240V ~ 50/60Hz, 60W 최대 소비량 72W 무선 주파수 2.4-2.48Hz 사운드 출력 60W(2CH) 주파수 범위 80Hz-20KHz 블루투스 호환버전 Version 4.2 블루투스 연결유지 사운드바에서 10m(벽, 파티션 등 무선수신 방해요소가 없는 거리) 오디오 지원형식 MP3, WMA 제품 사이즈 66×75×890mm 인증번호 R-C-KJ5-PSBB1904_PLUS 제품 구성 Stereo AUX in(3.5mm)/무선리모컨(건전지 포함)/사용자 설명서(제품보증서) 지원 입력단자 Stereo Line-IN/USB입력/Optical광입력/HDMI 입력 인증번호에서 1904 모델과 동일한 모델임을 확인할 수 있는듯 합니다. 그래서 많은 분들이 아워스페이스의 1904A 모델을 기다리시는 것 같은데 동일한 모델이 있다는 정보를 드리고자 합니다.찾다보니 아워스페이스 1904A와 트루비 TP60 이외에 같은 모델이 하나 더 있었습니다.와사비망고의 WM SB-3030BR 모델입니다. 그런데 와사비망고의 모델은 형태나 다른 스펙은 비슷해 보였는데 한 가지 스펙에서 차이를 보였습니다.블루투스 호환버전이 5.0 버전이었습니다. 같은 쌍둥이 모델을 OEM 방식으로 각각의 브랜드에서 로고만 변경해서 출시하여 판매하고 있는것 같습니다.간단한 사운드바에 대한 정보는 드렸으니, 개봉기를 통해 구성품을 한번 살펴 보겠습니다. 상자의 측면에 연결가능한 사운드 소스 종류와 기능 등에 대해 명시되어 있습니다. 여기서 잠깐!!분명 스펙상에는 블루투스 4.2였는데 박스 표시는 5.0으로 표시되고 있습니다. 무엇이 맞는 걸까요?혹시 블루투스 버전을 확인할 수 있는 방법이 있나요? 아시는 분 댓글 좀 달아주세요~ 정면에는 제품 브랜드와 제품명이 있습니다. 제품의 전체적인 형태도 확인이 가능합니다. 제품을 개봉하면 사운드바 본체와 리모컨, 제품설명서가 보입니다. 좌측에 보이는 작은 박스에 케이블과 전원어댑터가 들어있습니다. 전체 구성품입니다. 사운드바 본체, 무선 리모컨(배터리 포함), 제품설명서, 전원어댑터, 오디오케이블, AUX게이블이 박스에 동봉되어 있었으며, HDMI 케이블은 별도로 박스에 붙여서 함께 배송해 주셨습니다.HDIM(ARC)를 지원하는 모델이다 보니 HDMI 케이블이 동봉하여 보내주신거 같습니다. Optical광케이블이 포함되지 않은 것이 아쉽습니다. 그래서 광케이블은 별도로 구매해 두었습니다. 초점이 다 나가버렸네요 ^^;; 2개의 스피커 유닛이 보입니다. 좌/우측해서 총 4개의 유닛이 존재합니다. 입력단자들입니다. 좌측에서 부터 전원 연결부, AUX연결, LINE-IN, OPTICAL광단자, USB, HDMI(ARC) 단자 순입니다. 제품 정보 라벨입니다. 신고자에 (주)강진테크놀로지가 보이네요. 아워스페이스 제품도 (주)강진테크놀로지였는데 역시 한 가지 제품을 브랜드만 변경해서 출시하고 있는 것 같습니다.인증번호가 1904가 아니라 1911로 보이네요. 다른 블로그에서 1904A 리뉴를 하면서 블루투스 연결시 1911A로 잡으시던데 이제 이해가 됩니다. TV와 연결했습니다. 정확히는 셋탑의 광단자에 연결을 했습니다. 확실히 기존 TV의 사운드보다 뭔가 풍성해진 느낌입니다. TV 스피커가 20W로 알고 있는데 60W의 출력은 더 좋을거라는 기대에 구매했는데 좋습니다. TV의 사운드가 말썽을 부려 구매했지만 만족스럽습니다. 조금 더 사용해 보고 가능하면 사용기도 올려보겠습니다.1904에서 1911로 약간의 버전 변경이 있는 것으로 보입니다. 그러면서 블루투스 버전이 4.2에서 5.0으로 상향된게 아닌가 싶습니다. 추측이지만요.","link":"/2020/08/28/soundbar_top60/"},{"title":"ASUS ZENBOOK 14 REVIEW","text":"지난 3월 구매한 ASUS의 Zenbook14을 소개해 보려고 합니다.이전 Acer 노트북을 약 7년간 사용한 후 더 이상 업무용으로 사용하기 힘들겠다는 판단으로 새롭게 업무용으로 활용할 노트북을 알아보다 눈에 띈 Zenbook에 꽂혀 구매를 결정하게 되었습니다. 제가 구매한 모델은 ASUS ZENBOOK 14인치 모델인 UX433FN-A6120T입니다. Specifications 구분 내용 모델명 UX433FN-A6120T 색상 아이시클 실버(글로시 스크린) 프로세서 인텔 8세대(Whiskey Lake) Core i7-8565U1.8GHz(8M 캐시, 최대 4.6GHz) 운영체제 Windows 10(64bit) 디스플레이 14.0인치/Ultra Slim 300nits/FHD 1920×1080/Non-touch 메모리 LPDDR3 16GB 저장장치 PCIEG3x2 NVME 512G M.2 SSD 그래픽 Inter UHD 620 + Nvidia Geforce MX150 2GB DDR5 카메라 HD IR/RGB 콤보 카메라 지문인식 N/A 무선기술 802.11ac+블루투스 5.0(듀얼밴드) USB포트 USB2.0(Type A 1개), USB3.1(1세대 Type A 1개/2세대 Type C 1개) 인터페이스 헤드폰 출력&amp;오디오 입력 콤보 잭, HDMI(1개), Micro SD Reader(1개) 오디오 내장 어레이 마이크로폰(harmon / kardon) 무게 1.19Kg(배터리 포함) 크기 31.9(W)×19.9(D)×1.59(H) Cm 배터리 50WHrs, 3S1P, 3-Cell Li-on 키보드 일루미네이티드 치클릿 키보드 상세 스펙은 위 사양과 같습니다. 복잡하네요.그냥 14인치 FullHD 모니터에 8세대 i7 CPU에 16G 램, 지포스 외장 그래픽카드에 512GB SSD에 1.19Kg의 가벼운 노트북입니다.지문인식 기술은 포함되지 않고 IR카메라를 활용하여 Windows Hello로 얼굴인식을 이용하여 로그인합니다.그리고 ErgoLift 힌지를 사용하여 노트북 화면 오픈 시 뒷부분이 약 3도 정도 들리게 되면서 타이핑 포지션 최적화 및 냉각 시스템 최적화, 오디오 성능 향상 등을 강조하였습니다.또한 듀얼 기능 터치패드를 탑재하여 터치패드 내에 NumberPad를 추가하여 숫자 키패드를 이용할 수 있게 하는 아이디어가 돋보이는 상품입니다.MIL-STD 810G 밀리터리 기준 통과로 안정성과 내구성에 대한 부분도 많이 홍보를 하고 있습니다. 위에 설명된 많은 스펙과 기능들을 살펴보면서 이 모델을 선택한 이유는 하나였습니다. 가성비다들 비슷하시겠지만 저렴한 비용으로 고성능의 장비를 구매하고 싶었고 동일 스펙으로 많은 기종을 찾아보던 중 제가 구매했던 3월 초 가격으로 ZenBook는 160만원이 조금 안되는 가격이었으나, LG그램이나 삼성의 9 Always 시리즈는 200만원을 훌쩍 넘었습니다. 그러나 지금 생각해 보면 그 가격에는 다 그만한 이유가 있지않나라고 생각합니다.ASUS Zenbook14도 만족하면서 잘 사용하고 있지만 8개월 정도 사용하면서 아쉬운 부분이 조금씩 생기더라구요.. 3월 5일 예약 주문을 하고 3월 14일에서야 물건을 받아볼 수 있었습니다.당시에도 많이 찾아보고 구매를 결정하게 되었지만 많은 리뷰가 존재하지 않고 대부분 제품 지원으로 사용해 인플루언서들의 리뷰를 기준으로 판단하여 구매하였습니다.8개월이란 기간 업무용으로 활용하고 있으면서 조금 더 제가 느낀 부분을 공유하고자 이렇게 리뷰를 작성해 보게 되었습니다. 제 입장에서 이 제품은 충분히 만족하고 잘 만들어진 제품임에는 틀림이 없습니다.그러나 몇 가지 잘 알려지지 않은 사실을 정확히 알고 구매하는데 조금이나마 도움을 드리고자 합니다.참고로, 저는 다른 컴퓨터나 디바이스 리뷰어들처럼 전문적인 용어나 하드웨어 스펙, 프로그램 최적화 조합.. 뭐 이런거 잘 모릅니다.그냥 일반인 입장에서 제가 사용하면서 느낀 그대로를 편하게 풀어보고자 합니다. 첫번째 아쉬웠던 부분은 처음 제품을 받고 사용을 하면서 일주일도 안되어 탐색기에서 프리징 현상이 자꾸 발생했습니다.이것저것 인터넷 서칭을 해보고 해당 방법들로 처리해 보았지만 프리징 현상은 해결되지 않았습니다. 그리하여 ASUS 사이트를 방문하여 제품등록도 하고 해당 현상에 대한 문의를 하였습니다.ASUS 서비스 센터의 답변은 다음과 같았습니다. 윈도우 탐색기(Explorer)의 문제가 발생했을 경우엔, 설치하신 프로그램 혹은 멀웨어(또는 바이러스)의 영향으로 발생하는 경우가 많습니다. 따라서, 이런 경우엔 멀웨어 검색을 해보거나 혹은 OS 초기화를 시도해보셔야 합니다. 헐… 구매한지 얼마나 되었다고.. 뭐지? OS를 재설치 하라고… 과연 그럼 나아질까? 세팅하고 아무것도 하지 않았는데.. 재설치한다고 이게 사라진다고.. 그럼 초기에 잘못 설치해서 출고한거 아니야?.. 뭐 별 생각이 다들었습니다.그러나 프리징은 생각보다 쉽게 해결되었습니다. 프리징이 심하게 발생하던 부분은 이미지가 있는 폴더에 접근할 경우가 많더라구요.. 그래서 윈도우 탐색기의 보기 탭에서 “미리 보기 창”, “세부 정보 창” 2가지를 비활성화 했습니다.그랬더니 그 이후로는 탐색기 프리징 현상은 감쪽같이 사라졌습니다. 두번째 아쉬운 부분입니다.SSD가 512GB가 탑재된 모델이라 용량에 대한 부족은 없을 수 있으나, 작업 데이터가 많이 쌓일 것을 대비하여 Micro SD를 구매하여 추가로 슬롯에 장착하였습니다.제가 구매한 모델은 ‘리더스로직 micro SDXC UHS-I U3 V30 A1 메모리카드 CLASS10’ 모델로 다른 사용자들이 사용한 후기를 보았을 때 속도가 꽤 잘나오는 제품으로 확인 후 구매했습니다.그러나, 제가 원하는 속도가 나오지 않았습니다. 역시나 ASUS 고객센터 문의 결과 해당 제품의 MicroSD Bus Speed 규격은 다음과 같습니다.※ Support UHS(SDR-50/DDR-50) operation mode. 50MB/s따라서, 말씀하신 속도는 정상으로 예상됩니다. 안타깝습니다. 조금 더 높은 규격의 SD Reader를 사용했다면 확장포트를 활용하여 용량을 증설하는 사용자들에게 더 좋은 환경을 제공해 줄 수 있을텐데 하는 아쉬움이 들었습니다.LG 그램이나 삼성의 9 Always의 규격이 어떤지는 잘 모르겠지만, 포트를 제공하면서 너무 기대치를 미치지 못하게 한 부분이 아닌가 하는 생각에 돈이 값어치를 하는 것인가 하는 생각이 들게 하는 부분이었습니다.물론 사용하는데 큰 불편이 있는 부분은 아닐 수 있겠지만, 제 입장에서는 용량이 큰 데이터를 옮길 경우가 종종 있는데 외장 디스크에서 USB 3.1 포트를 이용하여 SSD로 옮길 경우에는 약 6GB의 데이터가 3~4분에 옮길 수 있었는데 SSD에서 MicroSD로 옮기는데는 40분 이상이 소요되는데 좌절할 수 밖에 없는 상황이었습니다. 세번째 아쉬운 것은 USB C 포트와 관련된 부분이었습니다.외부에서 작업하는 경우가 종종있어 노트북의 특성상 보조 모니터를 사용하고 싶었습니다.보통 USB C 포트의 DP Alt Mode를 이용하여 보조 모니터를 사용할 수 있는 환경이 많이 있었습니다. 그래서 ASUS의 MB16AC 모델을 물망에 올려놓고 있었는데 혹시나 하는 마음에 확인 차 문의하게 된 부분입니다.하지만 ASUS의 답변은 또 한번 저를 좌절하게 만들었습니다. 해당 제품의 USB-C 포트는 Data Transmission만 가능합니다.말씀하신 DP Alt Mode는 지원되지 않는 점 양해 부탁드립니다. 마찬가지로 PD 기능 또한 지원되지 않습니다.예를들어, MB16AC를 사용하시고자 한다면, Type-A로 변경하여 장착하시고 드라이버 설치 후 사용하셔야 합니다. 제가 구매한 Zenbook의 USB C 포트는 오직 데이터 이동용으로만 사용이 가능했습니다.이 부분은 꼭 필요한 분이 아니면 잘 사용하지 않을 수 있으니 그럭저럭 이해가 되는 부분이기는 했지만 역시 가격이 저렴한 부분에는 그에 상응하는 이유가 있을 수 밖에 없다는 생각이 자꾸 드는 부분이었습니다. 다행히 해당 기능은 저의 경우 안드로이드 탭을 구매하여 Spacedesk 라는 앱을 이용하여 구현해서 활용 중입니다. 무선으로 보조 모니터를 사용하다보니 약간의 딜레이가 생기는 부분은 있으나 나름 만족하며 사용하고 있습니다. Spacedesk 사이트 바로가기 위 3가지가 아니었다면 참 만족하고 사용했을 거 같은데 라는 아쉬움이 조금 들었지만 그 이외 부분에서는 성능이나 디자인면에서 아주 만족하며 잘 사용하고 있습니다.다른 리뷰어들이 간단한 사용기나 개봉기는 많이 보셨을 거 같아 그 외 제가 사용하면서 느낀 아쉬운 부분을 조금 토로해 보았습니다. 어떤 디바이스를 구매하든 모든 부분을 만족할 수는 없는 것 같습니다. 모든 부분을 만족하려면 정말 비용적인 부분은 신경을 쓰지 않고 구매를 해야 하는데 그렇지 못한다면 그 부분이 꼭 필요한 부분인지 잘 따져보고 신중히 구매해야 하지 않을까 싶습니다.서두에도 언급했지만 저도 하드웨어나 규격같은 부분은 잘 모르다 보니 이번에 제품을 구매하고 사용하면서 불편한 부분을 해결하려고 이것저것 찾아보면서 USB 포트의 세대별 특성, 속도 등의 규격, USB C 포트라고 다 동일한 기능을 하지는 않는 다는 것 등을 알 수 있었습니다.위에 스펙에도 작성을 했지만 인터페이스에 포트의 제공여부만 나와있지 어느 기능까지 하는지에 대한 부분은 많은 제품의 설명에서 나와있지 않습니다.그렇다보니 잘 아는 사람이 아니라면 누구나 실수를 할 수 밖에 없지 않는 부분이지 않을까 합니다. 조금 더 많은 정보를 요구할 수도 있겠지만 기업의 입장에서도 굳이 핸디캡에 대한 부분을 드러내고 싶지는 않을 것이며, 많은 사람들이 저처럼 특정 기능에 대한 부분을 요구하지 않았을 수도 있을거라는 생각을 하며, 본인이 필요한 기능이 있다면 구매 전 확인을 해보는 것도 나쁘지 않겠다는 생각을 하며 마무리 하려합니다.","link":"/2019/11/01/review_zenbook14/"},{"title":"2019년 한글날 기념 무료배포 한글 폰트","text":"언제가부터 매년 한글날이면 많은 기업체와 단체들에서 한글날 기념 무료 폰트를 제작하여 배포하고 있다.디자이너들이나 폰트를 많이 사용하는 일반인들의 경우 영문 폰트에 비해 무료로 사용할 수 있는 한글 폰트가 부족하여 항상 주로 사용하던 폰트 위주로 사용을 많이 하게 되는데, 매년 새로운 폰트가 무료로 배포되고 있는 것은 아주 반가운 일이 아닐 수 없다. 기업의 정체성을 나타낼 수 있는 특유의 개성을 포함하여 폰트를 제공함으로서 간접적인 홍보 효과도 나타낼 수 있으며, 사용자 입장에서는 한정된 폰트를 이용하던 것에 비해 다양한 폰트를 활용할 수 있음에 서로가 상생할 수 있는 방향으로 나아가는 길이라 생각된다. 2019년 573돌을 맞이한 한글날, 새롭게 배포된 한글 폰트를 소개해 보고자 한다.배포되는 대부분의 폰트는 저작권에 구애받지 않고 자유롭게 사용할 수 있으나, 간혹 서체마다 저작권에 약간씩의 차이가 있을 수 있으니, 반드시 저작권에 대한 정확한 정보 확인 후 사용하여 추후 발생할 수 있는 불상사에도 대비할 수 있도록 해야 하겠다. 네이버 ‘나눔손글씨’ 109종네이버에서 지난 9월부터 한글날 이벤트로 직접 쓴 손글씨 공모전을 진행하여 선정된 109종의 손글씨를 폰트로 제작하여 배포한다. ‘네이버 나눔손글씨’ 바로가기 유의사항 나눔손글씨 글꼴은 기업 및 단체 또는 개인 누구나 무료로 사용할 수 있습니다.다만, 나눔손글씨 글꼴 파일을 유상으로 제공, 판매, 배포하는 것은 금지됩니다. 한글날 손글씨 공모전 참여 시 입력한 글꼴명 및 글꼴 소개말은 임의로 변경되었을 수 있습니다. 제공하는 글꼴의 무료 제공 기간은 당사의 사정에 따라 예고 없이 변동될 수 있습니다. SBS 런닝맨 ‘전소민체’SBS ‘런닝맨 전소민체’는 한글날 특집 우승자인 전소민씨가 직접 작성한 자필 원고의 특징을 살려 ‘전소민’씨의 개성을 담고, 가독성을 고려한 손글씨 폰트로 만들어졌다.한글날 기념 ‘런닝맨 전소민체’는 ‘윤디자인그룹’이 함께 했습니다. 다만, 무료 배포기간이 2020년 1월 5일까지 3개월만 제공된다고 하니 원하는 분들은 빠른 다운로드를 해주셔야 되겠습니다. ‘런닝맨 전소민체’ 바로가기 저작권 안내 런닝맨 전소민체 글꼴 파일의 저작권은 SBS와 전소민, (주)윤디자인그룹에 있습니다. 런닝맨 전소민체 폰트 파일은, 3개월(2019.10.06 ~ 2020.01.05) 동안 무료로 제공하며,별도의 승인 없이 인쇄, 출판, 영상, 웹 모바일 등 다양한 매체에서 상업적 목적으로도 자유롭게 사용이 가능합니다.(단, 해당 글꼴을 변형하거나 폰트 파일 자체를 유료로 판매 또는 대여할 수 없으며 유해매체에서의 사용은 금지합니다) 런닝맨 전소민체 폰트를 사용한 인쇄물, 광고물(온라인 포함)의 이미지는 폰트 파일 저작권자의 홍보, 프로모션을 위해 활용될 수 있음에 동의합니다. 전소민체 폰트 파일 저작권에 대하여, 궁금한 사항이 있으시면 담당자(02-2287-6708)에게 연락 주시기 바랍니다. 사용범위 런닝맨 전소민체 폰트 파일은 개인/기업 구분없이 누구나 사용 가능합니다. 인쇄, 출판, 영상, 웹, 모바일 등 다양한 매체에서 상업적 목적으로 자유롭게 영구적인 사용이 가능합니다. 사용불가 폰트 파일의 수정 및 변형(디지털포맷 변경)을 포함한 개작, 개명을 통한 사용 별도 허락없이 임의로 재배포 및 유료양도 / 재판매 등의 상업적 행위 및 성인물, 도박물 등 유해매체에서의 사용 위 사항을 위반하는 경우, 위반 당사자는 저작권 침해에 따른 일체의 민형사상의 책임을 부담합니다. 별도문의 관련문의 : 02-2287-6703 / yoondesign@yoondesign.com 배달의민족 ‘을지로체’2012년 ‘한나체’ 공개를 시작으로 매년 한글날마다 ‘배달의민족’만의 감성으로 재생산한 무료 서체를 배달하고 있는 우아한형제들은 올해 ‘배달의민족 을지로체’를 새롭게 선보인다.‘베달의민족 을지로체’는 무명의 간판 글씨 장인이 그린 을지로 일대 가게들의 간판을 바탕으로 만든 것으로 획 마다의 힘찬 시작과 페인트 붓의 여유로운 끝 모양이 특징이다. ‘배달의민족 을지로체’ 바로가기 라이선스 주요내용 배달의민족 서체의 지적재산권은 (주)우아한형제들에 있습니다. 배달의민족 서체는 개인 및 기업 사용자를 포함한 모든 사용자에게 무료로 제공되며 자유롭게 수정하고 재배포하실 수 있습니다. 단, 글꼴 자체를 유료로 판매하는 것은 금지하며, 배달의민족 서체는 저작권 안내와 라이선스 전문을 포함해서 다른 소프트웨어와 번들하거나 재배포 또는 판매가 가능합니다.[라이선스 전문보기] 빙그레 ‘메로나체’2016년, 2017년, 2018년에 이어 한글서체 시리즈 제 4탄, ‘빙그레 메로나체’메로나 로고타입의 특징적인 요소를 자소에 반영하고 반듯한 네모의 형태로 젊은 느낌을 주는 구조로 레트로 감성을 표현하여 제작되었습니다.국문학자와 디자이너의 자문 의견을 반영하여 한글 11,172자와 한글날의 의미를 생각해 볼 수 있는 훈민정음 서문의 옛한글 31자를 추가로 개발하였습니다. ‘빙그레 메로나체’ 바로가기 라이선스 주요내용 빙그레 서체의 지적 재산권은 빙그레(www.bing.co.kr)에 있습니다. 빙그레 서체는 개인 및 기업 사용자를 포함한 모든 사용자에게 무료로 제공합니다. 빙그레 서체는 인쇄물, 광고물, 온라인 등 상업적 목적으로 사용할 수 있습니다. 단, 글꼴 자체를 유료로 판매하는 것은 금지하며 빙그레 서체는 수정 및 재배포를 할 수 없으며, 배포되는 형태 그대로 사용해야 합니다. 빙그레 서체를 사용한 인쇄물, 광고물(온라인 포함)의 이미지는 빙그레 프로모션을 위해 활용될 수 있습니다.이를 원치 않는 사용자는 언제든지 당사에 요청하실 수 있습니다.[라이선스 및 사용범위 전문보기] 넥슨 폰트 5종넥슨 레벨업넥슨의 LEVEL UP(레벨업) 첫 단계로 게임에서 경험했던 느낌을 서체에 담아 표현했습니다. 서체의 기능적인 부분 외에도 즐거운 경험들을 전달하고자 하는 또 다른 도전의 시작입니다.넥슨 Lv1. 고딕을 시작으로 레벨업이 돼 듯 Lv2. 고딕으로 업그레이드 되었고, 배찌손글씨체, 넥슨 풋볼 고딕, 메이플 서체 등 게임의 개성을 담아 다양한 서체를 제공하고 있습니다. ‘넥슨 서체 5종’ 바로가기 넥슨 폰트 사용정책 제공되는 모든 서체의 지적 재산권을 포함한 모든 권리는 (주)넥슨코리아에 있습니다. 제공되는 모든 서체는 개인, 학교, 공익목적의 자선, 구호단체에서 비상업적인 용도로만 사용 가능 합니다.단, 유료로 판매하거나 어떠한 이유로든 복사 및 배포의 대가로 요금을 부과/수령할 수 없으며, 인쇄물, 광고물, 온라인에서 상업적인 목적으로 사용할 수 없습니다. (주)넥슨코리아 이외에 임의로 수정, 편집 등을 할 수 없으며 배포되는 형태 그대로 사용해야 합니다. 디자인210 뿌리깊은 프로젝트 5호 서체 ‘ON정속언해’디자인210에서는 시대별 의미있는 글씨를 연구하며 뜻을 이어가고자 2018년 10월 석보상절을 시작으로 앞으로 출시되는 뿌리깊은 서체들이 3년간 개발, 런칭, 배포 됩니다.이에 573동 한글날을 맞이하여 프로젝트 5호 서체인 ‘ON정속언해’가 공개되었습니다.‘ON정속언해’는 ‘여씨향약언해’와 함께 백성들의 풍속을 교화시키기 위한 교화서 ‘정속언해’ 그 속에 담긴 의의와 한글 서체의 아름다움을 널리 알리고자 제작된 뿌리깊은 서체입니다. ‘ON정속언해’ 바로가기 라이선스 사용범위 제한없음 사용기한 제한없음 사용대상 누구나 사용자수 제한없음[라이선스 자세히보기] 폰트 프로젝트팀 ‘109폰트’2019 Korean day Font Project Team세 명이 팀을 꾸려서 각자 하고싶은 개성있는 폰트를 디자인하고 폰트를 제작하는 방식으로 ‘109다람쥐꼬리/109박스테이브/109벽에기댄체’ 3종의 폰트를 공개하였습니다. ‘Korean day Font Project Team 폰트 3종’ 바로가기 라이선스 자유롭게 사용 및 수정 가능 단, 유료배포 및 수정재배포 금지 전자책 전용글꼴 ‘리디바탕’전자책 플랫폼 서비스를 하고 있는 리디북스에서 전자책에서 잘 읽히는 글꼴을 찾는 독자들의 수고를 덜어드리고, 최상의 독서 경험을 제공하기 위해 만들었다고 합니다. ‘리디바탕’ 바로가기 라이선스 개인 및 기업 사용자를 포함한 모든 사용자에게 무료로 제공 자유롭게 수정 및 재배포 가능 단, 글꼴 자체를 유료로 판매하는 것은 금지 YES24 ‘예스체’예스24의 창립 20주년을 보다 뜻 깊게 기념하기 위해, 예스24가 가진 고유한 가치를 담아 서체를 개발예스체는 다양한 문화 콘텐츠가 뻗어나가는 공간이라는 YES24의 확장 이미지를 담고 있는 ‘햇살, 햇빛’을 그래픽 모티브로 제작되었습니다.10월 7일부터 ‘예스체’를 다운로드 받을 수 있으며, 11월부터 ‘예스 명조체’와 ‘예스 고딕체’를 만나볼 수 있습니다. ‘예스체’ 바로가기 라이선스 예스24 서체(예스체, 예스 명조, 예스 고딕)의 저작권은 예스24에 있습니다. 예스24 서체는 개인 및 기업 사용자를 포함한 모든 사용자에게 무료로 제공됩니다. 단, 글꼴 자체를 유료로 판매하는 것은 금지하며 해당 글꼴에 대한 변형 및 재배포를 할 수 없습니다. ‘쿠키런’ 글꼴쿠키런 글꼴은 귀여우면서도 도전적인 쿠키런만의 아이덴티티를 담은 글꼴입니다. ‘쿠키런 글꼴’ 바로가기 라이선스 쿠키런 글골의 지식 재산권은 데브시스터즈(주)에 있습니다. 쿠키런 클꼴은 개인 및 기업 사용자를 포함한 모든 사용자에게 무료로 제공되며 자유롭게 사용할 수 있습니다. 쿠키런 글꼴은 온/오프라인, 상품, 광고 등 상업적 목적으로 사용할 수 있습니다. 단, 글꼴 자체를 유료로 판매하거나, 어떠한 형태로든 임의 수정 및 개작하여 글꼴을 재배포 하는 것은 금지합니다. 쿠키런 글꼴은 배포되는 형태 그대로 사용해야 합니다. 쿠키런 딩벳 10자의 경우 상업적 목적으로 사용할 수 없으며, 비상업적인 용도에 한해 사용이 가능합니다. 많은 기업과 단체에서 한글의 다양성과 우수성을 알리고 많은 사람들이 널리 이롭게 사용할 수 있는 서체를 개발하여 배포하고 있습니다.제작하여 공개해 주심에 다시 한번 감사를 드리며, 잘 사용할 수 있도록 하겠습니다. 사용하심에 있어 서체마다의 라이선스가 다르니, 꼭 정확한 라이선스를 확인하시어 사용하시기 바랍니다.","link":"/2019/10/10/ko-fonts-2019/"},{"title":"트렌드 코리아 2020","text":"&lt;트렌드 코리아&gt;는 서울대 소비트렌드분석센터가 2007년부터 발표해온 10대 소비트렌드를 토대로 한국 사회를 관통한 큰 흐름을 도출하여 트렌드의 트렌드라고 할 수 있는 메가트렌드의 이해를 통해 앞으로 대한민국이 나아갈 방향을 가늠해 볼 수 있을 것이다. 2020년 트렌드 키워드는 과연 무엇일까요? 2020년은 경자년(庚子年) ‘쥐띠 해’입니다.쥐를 뜻하는 자子는 12간지 중 첫 번째로, 쥐는 꾀가 많고 영리한 동물로 옛날옛적 하늘의 대왕이 동물들을 정월 초하루에 천상의 문에 도착하는 차례대로 순서를 정해주겠다고 했는데, 소가 1등을 하려는 찰나, 소 등에 붙어 있던 쥐가 먼저 뛰어내려 1등을 했다는 이야기가 유명합니다. 매년 그 해의 띠 동물이 포함된 영문으로 트렌드 키워드를 정해온 전통에 따라 트렌드 코리아 2020의 키워드는 “MIGHTY MICE“입니다.2020년의 위기 상황을 한 사람의 영웅이 아니라, 복수의 소비자ㆍ시민들이 함께 힘을 합쳐 극복해나가자는 결의를 표현한 것입니다. 우선 지난 트렌드 코리아의 키워드를 잠시 살펴보고 2020년의 각 키워드에 대해 알아보도록 하겠습니다. 년도 키워드 2007 GOLDEN PIGS 2008 MICKEY MOUSE 2009 BIG CASHCOW 2010 TIGEROMICS 2011 TWO RABBITS 2012 DRAGONBALL 2013 COBRATWIST 2014 DARK HORSES 2015 COUNT SHEEP 2016 MONKEY BARS 2017 CHICKEN RUN 2018 WAG THE DOGS 2019 PIGGY DREAM 2020 MIGHTY MICE #1. Me and Myselves 멀티 페르소나이제 ‘나 자신’을 뜻하는 myself는 단수가 아니라 복수, 즉 myselves가 되어야 맞다. 현대인들이 다양하게 분리되는 정체성을 갖고 있기 때문이다. 직장에서와 퇴근 후의 정체성이 다르고, 평소와 덕질할 때의 정체성이 다르며, 일상에서와 SNS를 할 때의 정체성이 다르다. 심지어 SNS에서도 그것이 카카오톡이냐, 유튜브냐, 트위터냐, 인스타그램이냐에 따라 각기 다른 정체성으로 소통을 하고, 심지어는 하나의 SNS에서 동시에 여러 계정을 쓰며 자신의 모습을 이리저리 바꾼다. 마치 중국의 변검배우가 가면을 순간순간 바꿔 쓰듯이, 현대 소비자는 매 순간 다른 사람으로 변신한다. 이 가면을 학술적으로 ‘페르소나(persona)’라고 한다. 원래 페르소나는 고대 그리스에서 배우들이 쓰던 가면을 일컫는 말이었는데, 오늘날에는 심리학에서 타인에게 비치는 외적 성격을 지칭하는 용어로 쓰인다. 현대 사회가 점차 복잡하고 개인화된 다매체 사회로 변하면서 페르소나가 중요한 개념으로 새삼 떠오르고 있다. 최근에 다양한 양상의 트렌드가 나타나는 것도 “사람들이 자기 상황에 맞는 여러 개의 가면을 그때그때 바꿔 쓰고 있기 때문”이라고 분석할 수 있다.&lt;트렌드 코리아 2020&gt;에서는 이 복수의 가면을 ‘멀티 페르소나’라고 부르자고 한다. 멀티 페르소나의 시대, 인간의 다원성은 확장되었지만 역설적으로 정체성의 기반은 매우 불안정해졌다. 사회적으로는 소비자의 정체성이 과도하게 기술적으로 결정되는 부작용을 주의해야 하고, 기업들은 고객의 다원화된 정체성과 상황에 맞는 유연한 커뮤니케이션에 힘써야 한다. 다매체 시대를 사는 현대인의 고민이 깊어지고 있다. ‘나다움’이란 무엇인가?진짜 나는 누구인가? #2. Immediate Satisfaction the ‘Last Fit Economy’ 라스트핏 이코노미마지막 순간의 경험이 중요해졌다. ‘라스트 마일’은 원래 사형수가 집행장까지 걸어가는 마지막 거리를 뜻하는 말인데, 최근 유통업계에서 상품이 고객에게 전달되는 마지막 배송 접점을 의미하는 용어로 널리 쓰이고 있다. 배송과 관련한 라스트 마일은 물론이고, 다양한 산업에서 고객의 마지막 접점에 대한 만족도를 높이려는 시도가 눈에 띈다.&lt;트렌드 코리아 2020&gt;에서는 고객의 마지막 순간의 만족을 최적화하려는 근거리 경제를 ‘라스트핏 이코노미(Last Fit Ecomony)’라고 명명한다. 라스트핏은 고객의 마지막 접점까지 편리한 배송으로 쇼핑의 번거로움을 해소해주는 ‘배송의 라스트핏’ 가고자 하는 목표 지점까지 최대한 편하게 접근할 수 있도록 도와주는 ‘이동의 라스트핏’ 구매나 경험의 모든 여정의 대미를 만족스럽게 장식하는 ‘구매 여정의 라스트핏’ 이렇게 세가지 유형으로 나눌 수 있다. 이제 고객은 상품의 특성이나 브랜드가 주는 가치보다 주관적 효용을 기준으로 구매 의사를 결정한다. 나아가 편의성을 우선시하는 1인 가구가 증가하고 주관적 취향과 만족이 중요한 밀레니얼과 Z세대가 시장의 주역으로 등장하면서 라스트핏은 시장을 바꾸는 중요한 요인으로 자리 잡고 있다. 바야흐로 제품 속성 위주의 가성비 시대를 지나 서비스의 질로 소비자만족이 바뀌는 시대를 맞이하고 있다. 제품 자체의 성능보다 제품과 소비자가 맞닿는 그 접점에서의 만족이 더 중요해지고 있는 것이다. 기존 제품 중심의 동어 반복적인 모방과 차별화 경쟁에서 한 걸음 나아가 고객과 접촉하는 내밀한 순간에 집중해야 한다. 그 마지막 순간을 잡는 자가 시장을 잡을 것이다. #3. Goodness and Fairness 페어 플레이어공평하고 올바른 것에 대한 추구가 강해진다. 직장에서 내 노력의 결과를 팀장님께 돌리는 것은 공정하지 않다. 아무리 막내라도 자신의 기여는 합당하게 인정받아야 한다. 가사 노동은 구성원 모두에게 공평하게 배분돼야 하고, 학생들은 주관식보다 객관식 시험, 조별 과제보다는 개인 과제를 선호한다. 구매를 할 때도 상품 자체뿐만 아니라 그 브랜드의 올바른 ‘선한 영향력’을 중시한다. 개인성이 화두인 사회에서 자란 젊은 페어 플레이어들은 다양한 매체를 통해 자신의 작은 노력으로 사회를 변화시키길 원한다. 이슈가 있을 때마다 불붙는 불매운동은 단순한 열기가 아니라 이러한 공평성ㆍ선함ㆍ효능감에 대한 열망이 표현된 것이다. 한국 사회에서 공정성에 대한 열망이 커지는 원인을 꼽자면, 첫째, 한국 사회의 평등지향성이 높아지며 차별성에 대한 인식이 더욱 커졌기 때문이다.둘째, 경제적 풍요 속에 성장했지만 저성장 시대의 좌절감도 경험하고 있는, 치열한 경쟁이 생활화된 밀레니얼 세대의 특성 때문이다.셋째, 실시간 쌍방향 커뮤니케이션을 지원하는 정보 통신 기술의 영향력으로 자기 목소리를 충분히 낼 수 있는 페어 플에이어 세대의 효능감이 높아졌기 때문이다. 공정함에 대한 요구가 높아진 시대, 페이 플레이어 소비자는 구매 행위를 일종의 ‘화폐투표’로 활용한다. 이에 기업은 단순히 제품을 판매하는 것이 아니라 제품의 소비가 불러올 환경과 사회에 대한 영향력까지도 고려해야 한다.대한민국 역사상 가장 공정을 추구하는 세대가 일어서고 있다. 공정을 구하는 한국의 젊은 페어 플레이어들이 흔들리는 이 땅의 공정성을 구할 수 있기를 기대한다. 무한 경쟁에 내몰리는 밀레니얼 세대에게 공정함은 더욱 절실한 이슈다. #4. Here and Now : the ‘Streaming Life’ 스트리밍 라이프다운로드에서 스트리밍으로, 단지 음악을 듣는 방식을 넘어 삶의 방식이 바뀐다.‘스트리밍(Streaming)’이란 네트워크를 통해 음성이나 영상을 물 흐르듯 재생하는 기술을 일컫는데, 굳이 내려받아 소유하지 않아도 경험할 수 있다는 장점이 있다. 스트리밍에 익숙한 소비자들은 삶의 모든 면에 스트리밍을 적용하고 싶어한다. 첫째, 거주하는 공간을 스트리밍함으로써 자신의 로망을 실현하고 총체적인 라이프스타일을 디자인한다. 내가 살고 싶은 동네에서 살고 싶은 기간동안 다양한 컨셉의 공간을 이용함으로써 다양한 라이프스타일을 경험해보는 것이다.둘째, 전문가의 추천을 구독하는 방식으로 취미나 여가 활동도 스트리밍한다. 나의 취향에 맞는 스타일을 추천받고, 내 피부에 맞는 화장품을 정기적으로 배달받는다.마지막으로, 빌려서 경험한다. 다양한 선택지 중 무엇을 살까 고민할 필요없이 다양한 선택지를 모두 빌려서 써보는 것이다. 타보는 자동차뿐만 아니라 고가의 가방이나 가구까지 품목에 제한은 없다. 스트리밍 라이프의 확산 배경으로는 욕망은 부풀었는데 충족할 자원은 부족한 젊은 세대가 정주하지 않고 부유하는 노마드 라이프를 실현하고 있는 점을 들 수 있다. 기술의 발전이 상품ㆍ서비스ㆍ공간ㆍ경험 등을 소유하는 삶에서 스트리밍하는 삶으로의 이행을 가속화하는 것도 배경 중의 하나다. 스트리밍하듯 가볍지만 그 어느 때보다 풍부한 일상의 장면들을 채집하고 있는 현대인의 요구에 맞추기 위해서는 새로운 시장의 문법이 필요하다. 상품과 서비스가 한 번의 구매로 끝나지 않고 스트리밍되는 시대로 접어들면서 기업들에게 고객의 ‘구매 여정’ 전체를 관리하는 관계 중심적 접근이 더욱 중요해질 전망이다. 콘텐츠에서 시작된 스트리밍이 이제 삶의 전반으로 확대되고 있다. #5. Technology of Hyper-personalization 초개인화 기술실시간으로 소비자의 상황과 맥락을 파악하고 이해하며, 궁극적으로 고객의 니즈를 예측해 서비스와 상품을 제공하는 기술을 ‘초개인화 기술’이라고 한다.초개인화 기술은 빅데이터를 기반으로 각 개인의 프로파일을 개발한 후, 해당 프로파일에 관련된 콘텐츠를 입력하고, 제품을 권장하는 등 다양한 목적으로 활용될 수 있다. 이 기술의 특징은 모든 개인을 상황별로 구체화하고 더 자세히 접근하는 것이다. 궁극적으로는 회사가 개별 소비자의 데이터를 얼마나 갖고 있는가, 그 데이터를 얼마나 정교하게 분석하는가에 따라 기업과 소비자의 친밀한 상호작용을 현실적으로 가능하게 할 것이다. “아마존은 0.1명 규모로 세그먼트를 한다”는 말처럼 디지털 세계의 소비자는 한 명의 고객이 아니다. 한 명이 갖고 있는 다양한 특징을 드러내는, 개인화를 위해 기업은 고객 접점에서 분석 가능한 모든 데이터를 수집하고, 이를 AI 알고리즘을 통해 분석한 후, 다양한 미디어를 통해 상호 커뮤니케이션할 수 있어야 한다. 초개인화 기술은 궁극적으로 개개인의 고유한 니즈를 예측해 서비스와 상품을 제공하는 것이 목표다. 하지만 소비자 입장에서 기업이 자신의 정보를 꿰뚫고 있다는 사실은 불쾌감을 넘어 두려움으로 다가온다. 국가 정책적으로도 개인 정보 보호ㆍ산업 육성ㆍ소비자 편의의 균형을 맞추는 해안이 필요하다. 2020년 초개인화된 시장을 긍정적으로 혁신해나갈 수 있는 새로운 기술과 그를 뒷받침하는 담론들이 풍성하게 펼쳐지기를 기대한다. 제품에 이니셜을 새겨주는 개인화는 잊어라. #6. You’re with Us, ‘Fansumer’ 팬슈머주어진 대안 중에서 선택하는 것만으로는 성에 차지 않는다. 내가 직접 투자와 제조과정에 참여해 상품을, 브랜드를, 스타를 키워내고 싶다. 상품의 생애주기 전체에 직접 참여하는 소비자들, “내가 키웠다”는 뿌듯함에 적극적으로 지지하고 구매하지만 동시에 간섭과 견제도 하는 신종 소비자들을 일컬어 ‘팬슈머(Fansumer)’라고 명명한다.“나에 의해” 크고 작은 변화가 일어나고 있다고 믿는 이들의 움직임을 “바이미(by-me)” 신드롬이라고 부를 수도 있다. 소유에서 경험으로 이동한 소비의 패러다임이 이제 다시 경험에서 “관여(engagement)”로 발전하고 있다. 이와 같은 ‘관여 열기’는 선발과 양육, 기획과 제조, 유통과 홍보, 그리고 지지와 비판까지 시장의 전반적인 과정에 드리워진다.팬슈머가 영향을 미치는 영역은 갈수록 넒어지고 있다. 좋아하고 명분있는 사업에 투자하는 크라우드 펀딩이나 기업의 제품 개발ㆍMDㆍ마케팅 활동에 적극적으로 참여하는 서포터 활동은 물론이고, 연예인 팬슈머들은 기획사의 정책과 연예인의 데뷔 여부까지 관여하고 있다. 최근에는 SNS 세상의 연예인이라고 할 수 있는 인플루언서들도 팬슈머의 대상에 포함되면서 비판과 지지를 함께 받고 있다. 팬슈머의 성장은 단순한 유행이 아니다. 산업적ㆍ기술적인 기반이 갖추어진 가운데, 경제의 주축으로 진입하고 있는 밀레니얼과 X세대의 효능감이 복합적으로 적용한 필연적인 결과다. 팬슈머를 자산으로 만들어야 한다. 연예도 마케팅도 정치도 그리고 비지니스도 팬슈머 없이는 성장하기 어렵다. 이제 “고객과 함께”로는 부족하다. “고객에 의해” 좌우되는 팬슈머의 시장에서 소비자의 열성적인 지지와 참여에 손을 먼저 내밀어야 한다. 팬심을 넘어선 이유 있는 간섭!팬슈머들의 활약이 기대된다. #7. Make or Break, Specialize or Die 특화생존특화해야 살아남는다.누구에게나 보편적으로 괜찮은 것보다, 선택된 소수의 확실한 만족이 더 중요해졌다. 온라인 유통의 발달로 롱테일 경제가 활성화하고 과당 경쟁으로 제품 간의 차별점을 찾기 어려워진 가운데, 소비자의 니즈가 극도로 개인화하면서 표준화된 대중시장적 접근으로는 더 이상 소비자의 선택을 받을 수 없게 됐다. 이러한 빠른 변화와 격화되는 경쟁 속에서 기업은 ‘적자생존’에만 안주할 수 없게됐다. 진화의 다음 단계인 ‘특화생존’ 전략이 요구되는 시점이다.오로지 신데렐라 한 사람에게만 맞았던 유리구두처럼 단 한사람의 소비자에게 정확히 들어맞는 확실한 시장을 만들어내기 위해서는 타깃팅할 그룹을 세밀하게 관찰하고, 그 안에서 다시 세분화되는 초타깃팅을 실시한 후, 각 그룹을 만족시킬 특화 전략을 수립해야 한다. 특화를 위해서는 이처럼 타당하고 정밀한 쪼개기(segmentation) 전략이 중요한데, 이를 위해서는 핀셋처럼 ‘고객의 특성’을 관찰해 특화하고 싶은 마켓을 골라내고, 현미경처럼 산재하는 ‘고객의 니즈’를 파악해 그 중의 하나에 초점을 맞추거나, 컴퍼스처럼 지도 위에 동심원을 그려 해당 ‘지역 상권’의 특성에 집중하고, 낚싯대처럼 자사가 가지고 있는 ‘하나의 역량’에 힘을 모아야 한다. 지금은 그냥 고객만족이 아니라 ‘초’고객만족의 시대다. 우리 회사와 제품에 관심이 있을지 모르는 불특정 다수보다 확실하게 관심있는 특정 고객에 올인하는 전략이 더 유효하다. 니치(niche)한 것이 리치(rich)한 것이 된다. 좁히고, 줄이고, 날을 세워라.2020년에는 애자일 방법론으로 무장하고 초타깃팅과 마이크로 매니징으로 엣지를 살린 초정밀 특화 전략들의 향연이 펼쳐질 것이다. 적자생존의 진화, 이젠 ‘특화생존’이다! #8. Iridescent OPAL : the New 5060 Generation 오팔세대대한민국 소비 시장에 새로운 세대가 부각되고 있다. 한때는 노년으로 불리며 소비자로서 존재감이 약했던 베이비부머를 중심으로 한 5060 세대가 ‘신중년층’이라는 이름으로 새롭게 떠오르고 있는 것이다.인생에 기승전결이 있다면 지금이 바로 전성기라는 이들을 ‘오팔세대‘라고 부를 수 있다. 오팔세대의 ‘OPAL’은 ‘활기찬 인생을 살아가는 신노년층(Old People with Active Lives)‘의 약자이며, 동시에 베이비부머를 대표하는 ‘58년생 개띠‘의 ‘오팔’을 의미한다.무엇보다 이들이 뽐내는 다채로운 행보가 모든 보석의 색을 담고 있다는 오팔의 색을 닮았다는 의미를 담아, 베이비붐 세대를 중심으로 한 5060 신중년 소비자들을 ‘오팔세대’라 명명한다. 이들은 오랜 기간 매여 있던 직장을 떠났지만 다시 새로운 일자리에 도전하고, 나이 들수록 매 순간이 소중하다며 활발한 여가 생활을 즐긴다. 또한 젊은이들의 취향과 브랜드를 좇으며 새로운 소비 트렌드를 형성하고, 자신들만의 콘텐츠를 구매하면서 관련 업계의 판도를 바꾸고 있다. 오팔세대는 사실 매우 다양하면서도 까다로운 소비자 집단이다.단순히 커다란 글씨에 사용하기 쉬운 기능으로 접근하는 방식은 오팔세대의 호응을 얻을 수 없다. 은근하게 배려하는 세심함으로, 세분화된 라이프스타일로 접근해야 한다. 누가 이들을 완고한 시니어라고 부르는가? 고정관념을 버려라. 인터넷과 모바일을 젊은 이들만큼이나 자유자재로 사용하면서 사회의 주축으로 등장하는 오팔세대가 정체된 시장의 활력소가 될 것이다. 다채로운 빛깔의 오팔세대, 그들을 주목하라. #9. Convenience as a Premiun 편리미엄편리한 것이 프리미엄한 것이다. 구매의 기준이 가성비에서 프리미엄으로 이행하고 있는 가운데, 프리미엄의 요소가 또 한 번 변화하고 있다. 이제 프리미엄의 기준은 하고 싶은 일은 많고 시간은 부족한 현대인에게 최소한의 노력과 시간으로 최대한의 성과를 누릴 수 있게 해주는 것이다.일명 편리미엄 전략은 크게 세가지로 나뉜다. 해야 할 일에 대한 절대적 시간을 줄여주거나, 귀찮은 일에 들어가는 노력을 덜어주거나, 얻고자 하는 성과를 극대화시켜 주는 것이다. 편리성이 프리미엄의 요소로 편입되는 배경은 시대적이다. 시간 빈곤에 시달리는 현대의 젊은 소비자들은 다른 한편으로 그 시간을 다양한 경험과 자기성장에 투자하고 싶어한다. 더구나 옆집이나 친지에게 사소한 부탁도 할 수 없게 된 ‘약한 연대의 사회’에서는 작은 문제조차 스스로 해결하지 않으면 안 된다. 이런 여러 이유로 소비자들은 자신의 시간과 노력을 줄여줄 수 있다면 얼마든지 그 대가를 지불할 수 있다고 받아들인다. 일자리는 부족해지는 가운데 구직 청년은 물론이고 은퇴 후 ‘가교노동’을 원하는 노동자들이 늘어난 것도 한 요인이다. 이들이 플랫폼화하는 노동시장으로 별 제약 없이 유입되고 있는 것이다. 앞으로 편리미엄 시장은 빠른 속도로 성장할 것으로 보인다. 그러나 소비자ㆍ노동자ㆍ플랫폼의 신뢰를 향상시키는 것이 먼저다. 소비자의 사소한 불편함에 집중해 그들의 삶을 프리미엄하게 만들라. 사상 최악의 불경기라고는 하지만 여전히 기회는 존재한다. 이때 가장 필요한 것은 바로 소비자에 대한 면밀한 관심이다. 그들의 사소한 불편함에 집중하라. #10. Elevate yourself 업글인간성공보다 성장을 추구하는 새로운 자기계발형 인간, ‘업글인간’이 등장했다. 이들은 타인과의 경쟁이 아니라 어제보다 나아진 자신을 만드는데 변화의 방점을 찍는다. 나아가 자신을 중요시하는 ‘미코노미(me-conomy)‘의 소비자로서 먼 미래보다 지금 당장, 비일상보다 일상에서 소소하지만 확실한 행복을 원하는 소확행의 신봉자들이다. 이들에게 비좁은 성공 관문을 뚫는 스펙 쌓기가 아니라 어제보다 나은 나를 만드는 매일매일의 성장이 중요하다. 일과 삶의 전방위적 성장을 꿈꾸는 업글인간이 개발 중인 영역은 세가지다.첫째는 힘들지만 함께해서 즐거운 운동과 철저한 자기 관리로 만드는 몸의 업그레이드다.둘째는 새로운 경험과 즐거움의 경지를 개척하고 깊이를 더하는 취미의 업그레이드이며,마지막은 다양하게 가공된 지식 섭취와 살롱을 통해 지적 세계를 확장해가는 지식의 업그레이드를 꼽을 수 있다. 이 세가지 업글을 통해 핫한 몸, 딥한 취미, 힙한 지식을 갖추는 것이 업글인간의 자기계발 포인트다. 업글인간 트렌드는 주 52시간 근무제로 촉발된 ‘워라밸’추구의 단기적 사회 변화에 일부 기인하기도 하지만, 근본적으로는 고령화 사회에서 인생과 경력 관리의 패러다임이 달라져 나타난 결과다. 삶의 질적 변화를 원하는 업글인간의 등장으로 ‘경험경제’가 ‘변화경제’로 전환되고 있다. 변화경제에서는 소비자들은 자신의 진화를 돕는 경험을 위해 기꺼이 지갑을 연다.기업들은 각각의 소비자들이 지난 지향점을 파악하고 성장을 지원할 수 있는 접점을 고민해야 한다. 소비자들의 행복의 무게 추가 이제는 재미와 의미 사이의 균형을 향하고 있기 때문이다. 업글인간에게 현재는 성장이라는 재미와 의미로 채워가는 즐거운 게임과도 같다. 위 내용은 미래의 창 출판사 블로그 에서 발췌하여 정리하였습니다.","link":"/2019/11/18/trendkorea2020/"},{"title":"2020년 한글날 기념 무료배포 한글 폰트","text":"2020년 10월 9일, 574돌 한글날을 기념하여 만ㄹ은 기업과 단체에서 기념 폰트를 제작하여 무료배포 하였습니다.올해는 어떤 폰트들이 제작되어 배포되었는지 조금 늦었지만 살펴보고자 합니다. 배포되는 대부분의 폰트는 저작권에 구애받지 않고 자유롭게 사용할 수 있으나, 간혹 서체마다 저작권에 약간씩의 차이가 있을 수 있으니, 반드시 저작권에 대한 정확한 정보 확인 후 사용하여 추후 발생할 수 있는 불상사에도 대비할 수 있도록 해야 하겠습니다. 네이버 ‘마루부리’전년도에 손글씨 109종을 선보인데 이어 올해 네이버에서는 ‘마루 프로젝트’를 통해 ‘부리 글꼴’ 시험판을 지난 10월 7일 배포했습니다.우리가 흔히 알고 있는 명조체는 중국 명조 시대 글꼴을 칭하는 것으로 우리 한글꼴에는 어울리지 않아 한글의 모음 끝에 새의 부리(beak)와 같은 모양이 있다는 뜻에서 ‘부리 글꼴’ 이라 이름을 지어 글꼴을 제작하고 있다고 합니다.‘마루’느느 순루이말 표현으로 ‘첫째, 기준, 맏이, 으뜸, 높은’ 이라는 의미를 가지고 있다고 합니다. ‘네이버 마루부리’ 바로가기 현재 ‘마루 프로젝트’는 완성형이 아닌 시험판으로 사용자들의 의견을 취합하여 계속 개선을 진행하고 있습니다.10월 7일 공개 후 10월 21일까지 사용자의 의견을 취합하여 2021년 5종(Bold, Semi Bold, Regular, Light, Extra Light)의 최종 글꼴에 반영하여 출시한다고 합니다. ‘네이버 마루부리 글꼴 의견 제안’ 바로가기 디자인210 ‘나눔 한글 6종’디자인210에서 한글날을 맞아 무료폰트패키지를 ‘0원’에 판매하고 있습니다.패키지에 포함된 폰트는 ‘210파프리카, 210해오름, 210스카치테잎, 210악동클럽, 210오로라, 210에브리바디’ 6종입니다.한글 6종의 무제한(임베딩 제외) 평생사용권을 제공하고 있습니다. 다만, 무료 배포기간이 2020년 10월 8일부터 2020년 10월 18일까지 10일간만 제공됩니다.포스팅이 조금 늦어 현재는 다운로드 받을 수 없을 듯 합니다. ‘디자인210’ 바로가기 사용범위 안내 기본라이선스 범위(허용) : 문서/서식, 인쇄/출력, 웹사이트 옥내외광고 라이선스(허용) : 왹내외광고물 분야별 라이선스(허용) : 영상, 소프트웨어, 이북/이러닝, CI/BI, 2차제작물 별도 라이선스(불가) : 임베딩 자세한 사용범위는 바로가기 링크를 참고하시기 바랍니다. 유의사항 본 상품은 개인사용자만 이용이 가능합니다. 무단사용자 이용 불가 상품/무단사용자 : 정품 및 적합한 라이선스 미보유 상태에서 선사용(무단사용)한 모든 경우 배달의민족 ‘을지로10년후체’전년도(2019년)에 배포한 을지로체의 10년 후 모습을 상상하여 만들어진 ‘을지로10년후체’입니다.10년 동안 시간이 지나며 쌓인 햇빛과 비바람의 흔적을 느낄 수 있는 것이 특징입니다. 매년 독특하고 새로운 상상과 시도를 보여주는 배민인거 같습니다. ‘배달의민족 을지로10년후체’ 바로가기 라이선스 주요내용 배달의민족 서체의 지적재산권은 (주)우아한형제들에 있습니다. 배달의민족 서체는 개인 및 기업 사용자를 포함한 모든 사용자에게 무료로 제공되며 자유롭게 수정하고 재배포하실 수 있습니다. 단, 글꼴 자체를 유료로 판매하는 것은 금지하며, 배달의민족 서체는 저작권 안내와 라이선스 전문을 포함해서 다른 소프트웨어와 번들하거나 재배포 또는 판매가 가능합니다.[라이선스 전문보기] 빙그레 ‘싸만코체’2016년부터 매년 이어지고 있는 한글서체 시리즈 제 5탄, ‘빙그레 싸만코체’자사 제품인 붕어싸만코의 특징을 잘 표현하고 있는 폰트, 달콤한 웃음을 머금은 붕어싸만코를 그대로 담아 제작되었다고 합니다.한글 11,172자와 훈민정음 서문의 옛한글 31자, KS심볼 986자, 싸만코체를 더욱 재밌있게 즐길 수 있는 붕싸티콘 29자를 포함하고 있으며, Blod, Regular 2가지 타입이 제공됩니다. ‘빙그레 싸만코체’ 바로가기 라이선스 주요내용 빙그레 서체의 지적 재산권은 빙그레(www.bing.co.kr )에 있습니다. 빙그레 서체는 개인 및 기업 사용자를 포함한 모든 사용자에게 무료로 제공합니다. 빙그레 서체는 인쇄물, 광고물, 온라인 등 상업적 목적으로 사용할 수 있습니다. 단, 글꼴 자체를 유료로 판매하는 것은 금지하며 빙그레 서체는 수정 및 재배포를 할 수 없으며, 배포되는 형태 그대로 사용해야 합니다. 빙그레 서체를 사용한 인쇄물, 광고물(온라인 포함)의 이미지는 빙그레 프로모션을 위해 활용될 수 있습니다.이를 원치 않는 사용자는 언제든지 당사에 요청하실 수 있습니다.[라이선스 및 사용범위 전문보기] 디자인210 뿌리깊은 프로젝트 9호 서체 ‘ON화룡도’디자인210에서는 시대별 의미있는 글씨를 연구하며 뜻을 이어가고자 2018년 10월 석보상절을 시작으로 앞으로 출시되는 뿌리깊은 서체들이 3년간 개발, 런칭, 배포 됩니다.이에 574동 한글날을 맞이하여 프로젝트 9호 서체인 ‘ON화룡도’가 공개되었습니다.2019년 ‘ON정속언해’ 이후 6호 ‘ON송강가사’, 7호 ‘ON지장경언해’, 8호 ‘ON사략언해’, 그리고 9호 ‘ON화룡도’까지 발표되었고, 10호 ‘ON춘향전’은 2021년 1월 발표예정입니다. ‘ON화룡도’ 바로가기 라이선스 사용범위 제한없음 사용기한 제한없음 사용대상 누구나 사용자수 제한없음[라이선스 자세히보기] VITRO ‘비트로 코어, 비트로 프라이드’스포츠 브랜드 비트로에서 한글날을 맞이하여 전용서체 2종을 제공했습니다.비트로 전용서체는 힘세고 강한 고딕의 형태지만 모음에 부리가 있어 유니크한 스타일을 가졌습니다.한글의 ‘ㅅ, ㅈ, ㅊ’등의 자소에서 시원하게 쭉 뻗은 획의 스타일과 각이 있는 ‘ㅇ’을 통해 스포츠의 힘과 역동성을 표현합니다.또한 ‘ㅍ’에서 방향성 있는 유연한 움직임을 보여줍니다. 영문의 ‘p, u’등에서 각도가 있는 꺾임을 적용하여 한글과의 조화가 잘 이루어지도록 하였습니다.숨어있는 재미 요소로 비트로 딩벳(Dingbat) 16종을 제공하여 소소한 즐거움을 주고 있습니다. ‘비트로 전용서체 2종’ 바로가기 라이선스 비트로 서체의 지적재산권을 포함한 모든 권리는 ‘(주)학산’에게 있습니다. 비트로 서체를 다운로드 받는 사용자는 아래의 모든 라이선스 조항에 동의한 것으로 간주합니다. 비트로 서체는 개인 및 기업 사용자를 포함한 모든 사용자들에게 무료로 제공되며 온/오프라인, 상품, 광고 등 상업적 목적으로 사용할 수 있습니다.단, 스포츠 관련업종(스포츠 의류, 신발 및 용품 제조업, 스포츠 서비스, 스포츠 유통)의 상업적 목적으로 사용을 금지합니다. 비트로 서체 자체를 유료로 판매하거나, 어떠한 형태로든 임의 수정하여 서체를 재배포 하는 것은 금지합니다. (주)학산(계열사 포함)에 대하여 부정적 영향을 미칠 수 있거나 반사회적 제작물(음란물 등)에는 사용할 수 없습니다. 비트로 서체를 사용한 결과물은 (주)학산의 프로모션을 위해 활용될 수 있습니다. 이를 원치 않을 경우, 언제든지 당사에 요청할 수 있습니다.[라이선스 자세히보기] 한글과컴퓨터 ‘한컴 훈민정음 세로쓰기체’한글과컴퓨터에서 아래아한글 1.0을 시작으로 한글이 더 아름답게 쓰여질 수 있도록, 우리의 생각이 디지털세상에서 넓게 펼쳐질 수 있도록 한글 서체를 꾸준히 연구하고 배포하고 있습니다.한글과컴퓨터 30주년을 맞이하여 한글의 다양한 매력을 담은 서체 3종(한컴 훈민정음 세로쓰기체, 한컴 말랑말랑체, 한컴 산스체)을 무료보 배포하였습니다.전자책 플랫폼 서비스를 하고 있는 리디북스에서 전자책에서 잘 읽히는 글꼴을 찾는 독자들의 수고를 덜어드리고, 최상의 독서 경험을 제공하기 위해 만들었다고 합니다. ‘한컴서체 3종’ 바로가기 라이선스 한컴 서체의 지적 재산권은 한글과컴퓨터(www.hancom.com )에 있습니다. 한컴 서체는 개인 및 기업 사용자를 포함한 모든 사용자에게 무료로 제공합니다. 한컴 서체는 인쇄물, 광고물, 온라인 등 상업적 목적으로 사용할 수 있습니다. 단, 글꼴 자체를 유료로 판매하는 것은 금지하며 한컴 서체는 수정 및 재배포를 할 수 없으며, 배포되는 형태 그대로 사용해야 합니다. 한컴 서체를 사용한 인쇄물, 광고물(온라인 포함)의 이미지는 한글과컴퓨터 및 한컴그룹의 프로모션을 위해 활용될 수 있습니다.[라이선스 자세히보기] 7-ELEVEN ‘김좌진장군체’2020년 10월, 청산리전투 승전 100주년과 574돌 한글날을 맞아 업계 최초의 독립서체이자 국내 최초의 ‘김좌진장군체’를 선보였습니다.김좌진 장군의 붓글씨에서 모티브를 얻어, 이를 한글의 구조에 맞게 정돈 후 활자화 하여 개발, 반흘림체의 디자인을 가미했으며, 강하게 내려 그은 세로획은 김좌진 장군의 강직하고 굳센 기세를 드러냅니다.세븐일레븐의 나라사랑을 담아 전 국민에세 무료 제공되어 사용할 수 있습니다. 세븐일레븐 ‘김좌진장군체’ 바로가기 라이선스 김좌진장군체의 지적재산권은 (주)코리아세븐에 있습니다. 기업사용자의 상업적인 용도로 사용할 수 없습니다. 어떠한 이유로도 지적재산권 이외의 사용자가 수정, 판매할 수 없으며, 배포되는 형태 그대로 사용해야 합니다. 공게임즈 ‘이사만루체’2020년 한글날을 맞이하여, 공게임즈와 폰트릭스가 손잡고 개발한 공게임즈 전용폰트 ‘이사만루체’를 공개하였습니다.Blod, Medium, Light 3종으로 제공되어 있어 제목이나 본문에 사용이 용이합니다. 공게임즈 ‘이사만루체’ 바로가기 라이선스 이사만루체의 지적재산권 및 모든 권리는 (주)공게임즈에 있습니다. 상업적 용도를 포함하여 누구나 자유롭게 사용할 수 있으나, 임의로 수정하여 유료로 판매하는 것은 금지합니다. 서체를 사용한 인쇄물, 광고물(온라인 포함)은 (주)공게임즈의 프로모션을 위해 활용될 수 있습니다. KOTRA ‘코트라볼드, 코트라고딕, 코트라손글씨’우리 한긓의 아름다움을 널리 알리고, 저작권에서 자유로운 한글 글꼴 개방을 통한 국민의 편익 증진을 위하여 코트라 폰트를 중소ㆍ중견기업과 국민들에게 무료 배포합니다. 코트라 볼드체는 곧고 굵은 제목서체 컨셉에 역동적인 고딕, 리듬감을 느낄 수 있도록 우상향의 각도를 더한 자소 디자인으로 제작되었습니다. 코트라 고딕체는 코트라 볼드체와 조화를 이룰 수 있는 문장배열을 위해 가장 기본적인, 기본에 충실한 틀에서 정부표준형 완성형코드(KS)기준 한글 2,350자와 확장 글씨 224자로 제작되었습니다.초성 꺽임에 부드러운 곡선미를 더하고, 초성 꼭지점을 곧게 세워내 현대적인 느낌을 담았습니다. 그리고 우상향 각도를 더해 진취적, 성장의 의미도 담았습니다. 코트라 손글씨체는 정부표준형 완성형코드(KS)기준 2,350자와 영어, 숫자, 특수문자 일부로 제작되었습니다. KOTRA ‘코트라 폰트’ 바로가기 라이선스 개인, 기관, 기업 모두 사용가능(상업적 목적의 활용가능) 단, 폰트를 임의적으로 수정하거나 재배포하는 것을 금지합니다.(kotra 홈페이지를 통해서만 배포 가능) 사용문의 : kotra 고객서비스실 전상모 과장(02-3460-7312) 영양군 ‘음식디미방체’영양군 음식디미방체는 풍부한 문화 유적과 자연경관을 보전하고 있는 영양군의 이미지와 우리나라 최고(最古)의 한글조리서 음식디미방의 저자인 장계향 선생의 붓글씨를 결합하였습니다.획과 글자 자체의 형태에 집중하여 붓의 질감과 흐름을 충실히 표현하였고, 자소의 굵기와 밀도를 다르게 하여 서체의 무게감과 시각적 안정감이 느껴지도록 하였다.영양군 음식디미방체는 Bold 1종으로 한글 2,350자, 영문 94자, 특수문자 986자로 구성되어 있습니다. 영양군 ‘음식디미방체’ 바로가기 라이선스 영양군 음식디미방체는 누구나 무료로 다운로드 받아 사용하실 수 있습니다. 영상, 매체, 인터넷, 모바일 등 다양한 매체에서 자유롭게 사용이 가능하며, 특별한 허가 절차 없이 사용하실 수 있습니다. 위메프 ‘위메프체’영양군 음식디미방체는 풍부한 문화 유적과 자연경관을 보전하고 있는 영양군의 이미지와 우리나라 최고(最古)의 한글조리서 음식디미방의 저자인 장계향 선생의 붓글씨를 결합하였습니다.획과 글자 자체의 형태에 집중하여 붓의 질감과 흐름을 충실히 표현하였고, 자소의 굵기와 밀도를 다르게 하여 서체의 무게감과 시각적 안정감이 느껴지도록 하였다.영양군 음식디미방체는 Bold 1종으로 한글 2,350자, 영문 94자, 특수문자 986자로 구성되어 있습니다. ‘위메프체’ 바로가기 라이선스 위메프 전용서체 ‘위메프체’의 저작권을 포함한 모든 지식재산권은 ‘위메프’가 소유합니다. ‘위메프체’는 개인 및 기업을 포함한 모든 사용자에게 무료로 제공되며 자유로운 사용이 가능합니다. ‘위메프체’ 사용 시 서체의 출처 표기를 권장합니다.&lt;예시&gt;이 페이지에는 (주)위메프가 제공한 위메프체가 적용되어 있습니다. ‘위메프체’를 사용한 인쇄물, 광고물(온/오프라인)등의 이미지는 ‘위메프’의 마케팅과 프로모션을 위해 활용될 수 있습니다. 이를 원치 않는 사용자는 언제든지 당사에게 그 활용의 중단을 요청할 수 있습니다. 단, 서체 자체의 유료 판매 행위, 임의 수정/개작 및 이를 배포하는 행위, 본 서체를 사용하여 상호, CI/BI로고 등을 제작하거나 이를 상표로써 사용하는 행위는 어떠한 형태로든 금지합니다. 또한 위메프의 이미지를 훼손할 수 있는 불법 사이트나 허위 과장광고, 기타 공서양속에 반하는 인쇄물/광고물에 사용을 금지합니다. 많은 기업과 단체에서 한글의 다양성과 우수성을 알리고 많은 사람들이 널리 이롭게 사용할 수 있는 서체를 개발하여 배포하고 있습니다.제작하여 공개해 주심에 다시 한번 감사를 드리며, 잘 사용할 수 있도록 하겠습니다. 사용하심에 있어 서체마다의 라이선스가 다르니, 꼭 정확한 라이선스를 확인하시어 사용하시기 바랍니다.","link":"/2020/10/23/ko-fonts-2020/"}],"tags":[{"name":"GoogleOne","slug":"GoogleOne","link":"/tags/GoogleOne/"},{"name":"구글원","slug":"구글원","link":"/tags/구글원/"},{"name":"리뷰","slug":"리뷰","link":"/tags/리뷰/"},{"name":"REVIEW","slug":"REVIEW","link":"/tags/REVIEW/"},{"name":"Google","slug":"Google","link":"/tags/Google/"},{"name":"구글","slug":"구글","link":"/tags/구글/"},{"name":"무료체험","slug":"무료체험","link":"/tags/무료체험/"},{"name":"지역가이드","slug":"지역가이드","link":"/tags/지역가이드/"},{"name":"Local","slug":"Local","link":"/tags/Local/"},{"name":"hexo","slug":"hexo","link":"/tags/hexo/"},{"name":"blog","slug":"blog","link":"/tags/blog/"},{"name":"사운드바","slug":"사운드바","link":"/tags/사운드바/"},{"name":"트루비","slug":"트루비","link":"/tags/트루비/"},{"name":"TP60","slug":"TP60","link":"/tags/TP60/"},{"name":"아워스페이스","slug":"아워스페이스","link":"/tags/아워스페이스/"},{"name":"OSSBB-1809A","slug":"OSSBB-1809A","link":"/tags/OSSBB-1809A/"},{"name":"OSSBB-1904A","slug":"OSSBB-1904A","link":"/tags/OSSBB-1904A/"},{"name":"OSSBB-1911A","slug":"OSSBB-1911A","link":"/tags/OSSBB-1911A/"},{"name":"와사비망고","slug":"와사비망고","link":"/tags/와사비망고/"},{"name":"WM SB-3030BR","slug":"WM-SB-3030BR","link":"/tags/WM-SB-3030BR/"},{"name":"soundbar","slug":"soundbar","link":"/tags/soundbar/"},{"name":"60W","slug":"60W","link":"/tags/60W/"},{"name":"ASUS","slug":"ASUS","link":"/tags/ASUS/"},{"name":"ZENBOOK","slug":"ZENBOOK","link":"/tags/ZENBOOK/"},{"name":"NOTEBOOK","slug":"NOTEBOOK","link":"/tags/NOTEBOOK/"},{"name":"UX433FN-A6120T","slug":"UX433FN-A6120T","link":"/tags/UX433FN-A6120T/"},{"name":"14인치","slug":"14인치","link":"/tags/14인치/"},{"name":"노트북","slug":"노트북","link":"/tags/노트북/"},{"name":"사용기","slug":"사용기","link":"/tags/사용기/"},{"name":"폰트","slug":"폰트","link":"/tags/폰트/"},{"name":"한글 서체","slug":"한글-서체","link":"/tags/한글-서체/"},{"name":"네이버","slug":"네이버","link":"/tags/네이버/"},{"name":"나눔손글씨","slug":"나눔손글씨","link":"/tags/나눔손글씨/"},{"name":"런닝맨","slug":"런닝맨","link":"/tags/런닝맨/"},{"name":"전소민체","slug":"전소민체","link":"/tags/전소민체/"},{"name":"배달의민족","slug":"배달의민족","link":"/tags/배달의민족/"},{"name":"을지로체","slug":"을지로체","link":"/tags/을지로체/"},{"name":"빙그레","slug":"빙그레","link":"/tags/빙그레/"},{"name":"메로나체","slug":"메로나체","link":"/tags/메로나체/"},{"name":"넥슨","slug":"넥슨","link":"/tags/넥슨/"},{"name":"Lv1. 고딕","slug":"Lv1-고딕","link":"/tags/Lv1-고딕/"},{"name":"Lv.2 고딕","slug":"Lv-2-고딕","link":"/tags/Lv-2-고딕/"},{"name":"배찌손글씨체","slug":"배찌손글씨체","link":"/tags/배찌손글씨체/"},{"name":"풋볼 고딕","slug":"풋볼-고딕","link":"/tags/풋볼-고딕/"},{"name":"메이플체","slug":"메이플체","link":"/tags/메이플체/"},{"name":"ON정속언해","slug":"ON정속언해","link":"/tags/ON정속언해/"},{"name":"디자인 210","slug":"디자인-210","link":"/tags/디자인-210/"},{"name":"정속언해체","slug":"정속언해체","link":"/tags/정속언해체/"},{"name":"109폰트","slug":"109폰트","link":"/tags/109폰트/"},{"name":"109다람쥐꼬리","slug":"109다람쥐꼬리","link":"/tags/109다람쥐꼬리/"},{"name":"109박스테이브","slug":"109박스테이브","link":"/tags/109박스테이브/"},{"name":"109벽에기댄체","slug":"109벽에기댄체","link":"/tags/109벽에기댄체/"},{"name":"리디바탕","slug":"리디바탕","link":"/tags/리디바탕/"},{"name":"예스체","slug":"예스체","link":"/tags/예스체/"},{"name":"예스 명조","slug":"예스-명조","link":"/tags/예스-명조/"},{"name":"예스 고딕","slug":"예스-고딕","link":"/tags/예스-고딕/"},{"name":"쿠키런","slug":"쿠키런","link":"/tags/쿠키런/"},{"name":"fonts","slug":"fonts","link":"/tags/fonts/"},{"name":"트렌드코리아","slug":"트렌드코리아","link":"/tags/트렌드코리아/"},{"name":"멀티페르소나","slug":"멀티페르소나","link":"/tags/멀티페르소나/"},{"name":"라스트핏이코노미","slug":"라스트핏이코노미","link":"/tags/라스트핏이코노미/"},{"name":"페어플레이어","slug":"페어플레이어","link":"/tags/페어플레이어/"},{"name":"스트리밍라이프","slug":"스트리밍라이프","link":"/tags/스트리밍라이프/"},{"name":"초개인화기술","slug":"초개인화기술","link":"/tags/초개인화기술/"},{"name":"팬슈머","slug":"팬슈머","link":"/tags/팬슈머/"},{"name":"특화생존","slug":"특화생존","link":"/tags/특화생존/"},{"name":"오팔세대","slug":"오팔세대","link":"/tags/오팔세대/"},{"name":"편리미엄","slug":"편리미엄","link":"/tags/편리미엄/"},{"name":"업글인간","slug":"업글인간","link":"/tags/업글인간/"},{"name":"마루부리","slug":"마루부리","link":"/tags/마루부리/"},{"name":"디자인210","slug":"디자인210","link":"/tags/디자인210/"},{"name":"210파프리카","slug":"210파프리카","link":"/tags/210파프리카/"},{"name":"210해오름","slug":"210해오름","link":"/tags/210해오름/"},{"name":"210스카치테잎","slug":"210스카치테잎","link":"/tags/210스카치테잎/"},{"name":"201악동클럽","slug":"201악동클럽","link":"/tags/201악동클럽/"},{"name":"210오로라","slug":"210오로라","link":"/tags/210오로라/"},{"name":"210에브리바디","slug":"210에브리바디","link":"/tags/210에브리바디/"},{"name":"배민","slug":"배민","link":"/tags/배민/"},{"name":"을지로10년후체","slug":"을지로10년후체","link":"/tags/을지로10년후체/"},{"name":"싸만코체","slug":"싸만코체","link":"/tags/싸만코체/"},{"name":"VITRO","slug":"VITRO","link":"/tags/VITRO/"},{"name":"비트로 코어","slug":"비트로-코어","link":"/tags/비트로-코어/"},{"name":"비트로 프라이드","slug":"비트로-프라이드","link":"/tags/비트로-프라이드/"},{"name":"한글과컴퓨터","slug":"한글과컴퓨터","link":"/tags/한글과컴퓨터/"},{"name":"한컴 훈민정음 세로쓰기체","slug":"한컴-훈민정음-세로쓰기체","link":"/tags/한컴-훈민정음-세로쓰기체/"},{"name":"한컴 말랑말랑체","slug":"한컴-말랑말랑체","link":"/tags/한컴-말랑말랑체/"},{"name":"한컴 산스체","slug":"한컴-산스체","link":"/tags/한컴-산스체/"},{"name":"7-ELEVEN","slug":"7-ELEVEN","link":"/tags/7-ELEVEN/"},{"name":"세븐일레븐","slug":"세븐일레븐","link":"/tags/세븐일레븐/"},{"name":"김좌진장군체","slug":"김좌진장군체","link":"/tags/김좌진장군체/"},{"name":"공게임즈","slug":"공게임즈","link":"/tags/공게임즈/"},{"name":"이사만루체","slug":"이사만루체","link":"/tags/이사만루체/"},{"name":"KOTRA","slug":"KOTRA","link":"/tags/KOTRA/"},{"name":"코드라볼드","slug":"코드라볼드","link":"/tags/코드라볼드/"},{"name":"코트라고딕","slug":"코트라고딕","link":"/tags/코트라고딕/"},{"name":"코그라손글씨","slug":"코그라손글씨","link":"/tags/코그라손글씨/"},{"name":"위메프","slug":"위메프","link":"/tags/위메프/"},{"name":"위메프체","slug":"위메프체","link":"/tags/위메프체/"}],"categories":[{"name":"Review","slug":"Review","link":"/categories/Review/"},{"name":"hexo","slug":"hexo","link":"/categories/hexo/"},{"name":"Service","slug":"Review/Service","link":"/categories/Review/Service/"},{"name":"Device","slug":"Review/Device","link":"/categories/Review/Device/"},{"name":"Resource","slug":"Resource","link":"/categories/Resource/"},{"name":"Fonts","slug":"Resource/Fonts","link":"/categories/Resource/Fonts/"}]}